espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Configuration registers */
/** Type of slc_conf0 register
 *  Sdio slave DMA configuration register.
 */
typedef union {
    struct {
        /** slc0_tx_rst : R/W; bitpos: [0]; default: 0;
         *  Set 1 to reset receiving fsm in dma channel0.
         */
        uint32_t slc0_tx_rst:1;
        /** slc0_rx_rst : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset transmitting fsm in dma channel0.
         */
        uint32_t slc0_rx_rst:1;
        /** slc_ahbm_fifo_rst : R/W; bitpos: [2]; default: 0;
         *  reset the command fifo of AHB bus of sdio slave
         */
        uint32_t slc_ahbm_fifo_rst:1;
        /** slc_ahbm_rst : R/W; bitpos: [3]; default: 0;
         *  reset the AHB bus of sdio slave
         */
        uint32_t slc_ahbm_rst:1;
        /** slc0_tx_loop_test : R/W; bitpos: [4]; default: 0;
         *  Loop around when the slave buffer finishes receiving packets. When set to 1,
         *  hardware will not change the owner bit in the linked list.
         */
        uint32_t slc0_tx_loop_test:1;
        /** slc0_rx_loop_test : R/W; bitpos: [5]; default: 0;
         *  Loop around when the slave buffer finishes sending packets. When set to 1, hardware
         *  will not change the owner bit in the linked list.
         */
        uint32_t slc0_rx_loop_test:1;
        /** slc0_rx_auto_wrback : R/W; bitpos: [6]; default: 0;
         *  Set 1 to enable change the owner bit of rx link descriptor
         */
        uint32_t slc0_rx_auto_wrback:1;
        /** slc0_rx_no_restart_clr : R/W; bitpos: [7]; default: 0;
         *  Set this bit to disable the function that when slave starts to send data to host,
         *  the slc0_bt_rx_new_packet_int_raw or slc0_host_rd_retry_int_raw will be
         *  automatically cleared.
         */
        uint32_t slc0_rx_no_restart_clr:1;
        /** slc0_rxdscr_burst_en : R/W; bitpos: [8]; default: 1;
         *  0- AHB burst type is single when slave read rx-descriptor from memory through
         *  slc0,1-AHB burst type is not single when slave read rx-descriptor from memory
         *  through slc0
         */
        uint32_t slc0_rxdscr_burst_en:1;
        /** slc0_rxdata_burst_en : R/W; bitpos: [9]; default: 1;
         *  0- AHB burst type is single when slave receives data from memory,1-AHB burst type
         *  is not single when slave receives data from memory
         */
        uint32_t slc0_rxdata_burst_en:1;
        /** slc0_rxlink_auto_ret : R/W; bitpos: [10]; default: 1;
         *  enable the function that when host reading packet retries, slc1 will automatically
         *  jump to the start descriptor of the previous packet.
         */
        uint32_t slc0_rxlink_auto_ret:1;
        /** slc0_txlink_auto_ret : R/W; bitpos: [11]; default: 1;
         *  enable the function that when host sending packet retries, slc1 will automatically
         *  jump to the start descriptor of the previous packet.
         */
        uint32_t slc0_txlink_auto_ret:1;
        /** slc0_txdscr_burst_en : R/W; bitpos: [12]; default: 1;
         *  0- AHB burst type is single when slave read tx-descriptor from memory through
         *  slc0,1-AHB burst type is not single when slave read tx-descriptor from memory
         *  through slc0
         */
        uint32_t slc0_txdscr_burst_en:1;
        /** slc0_txdata_burst_en : R/W; bitpos: [13]; default: 1;
         *  0- AHB burst type is single when slave send data to memory,1-AHB burst type is not
         *  single when slave send data to memory
         */
        uint32_t slc0_txdata_burst_en:1;
        /** slc0_token_auto_clr : R/W; bitpos: [14]; default: 1;
         *  auto clear slc0_token1 enable
         */
        uint32_t slc0_token_auto_clr:1;
        /** slc0_token_sel : R/W; bitpos: [15]; default: 1;
         *  0: choose to save slc0_token0's value, 1: choose to save the accumulative value of
         *  slc0_token1
         */
        uint32_t slc0_token_sel:1;
        /** slc1_tx_rst : R/W; bitpos: [16]; default: 0;
         *  Set 1 to reset receiving fsm in dma slc0.
         */
        uint32_t slc1_tx_rst:1;
        /** slc1_rx_rst : R/W; bitpos: [17]; default: 0;
         *  Set 1 to reset sending fsm in dma slc0.
         */
        uint32_t slc1_rx_rst:1;
        /** slc0_wr_retry_mask_en : R/W; bitpos: [18]; default: 1;
         *  Set this bit to generate an interrupt when host sending retry finishes and prevent
         *  host still retrying after one successful retry through dma channel0
         */
        uint32_t slc0_wr_retry_mask_en:1;
        /** slc1_wr_retry_mask_en : R/W; bitpos: [19]; default: 1;
         *  Set this bit to generate an interrupt when host sending retry finishes and prevent
         *  host still retrying after one successful retry through dma channel0
         */
        uint32_t slc1_wr_retry_mask_en:1;
        /** slc1_tx_loop_test : R/W; bitpos: [20]; default: 1;
         *  owner control when slc1 writes back tx descriptor: 0- cpu is owner, 1-dma is owner.
         */
        uint32_t slc1_tx_loop_test:1;
        /** slc1_rx_loop_test : R/W; bitpos: [21]; default: 1;
         *  owner control when slc1 writes back rx descriptor: 0- cpu is owner, 1-dma is owner.
         */
        uint32_t slc1_rx_loop_test:1;
        /** slc1_rx_auto_wrback : R/W; bitpos: [22]; default: 0;
         *  Set 1 to enable change the owner bit of the transmitting buffer's linked list when
         *  transmitting data.
         */
        uint32_t slc1_rx_auto_wrback:1;
        /** slc1_rx_no_restart_clr : R/W; bitpos: [23]; default: 0;
         *  Set this bit to disable the function that when slave starts to send data to host,
         *  the slc1_bt_rx_new_packet_int_raw, slc1_wifi_rx_new_packet_int_raw or
         *  slc1_host_rd_retry_int_raw will be automatically cleared.
         */
        uint32_t slc1_rx_no_restart_clr:1;
        /** slc1_rxdscr_burst_en : R/W; bitpos: [24]; default: 1;
         *  0- AHB burst type is single when dma channel1 fetches linked list for sending
         *  data,1-AHB burst type is not single when dma channel1 fetches linked list for
         *  sending data
         */
        uint32_t slc1_rxdscr_burst_en:1;
        /** slc1_rxdata_burst_en : R/W; bitpos: [25]; default: 1;
         *  0- AHB burst type is single when slave receives data through dma channel1,1-AHB
         *  burst type is not single when slave receives data through dma channel1
         */
        uint32_t slc1_rxdata_burst_en:1;
        /** slc1_rxlink_auto_ret : R/W; bitpos: [26]; default: 1;
         *  enable the function that when host reading packet retries, dma channel1 will
         *  automatically jump to the start descriptor of the previous packet.
         */
        uint32_t slc1_rxlink_auto_ret:1;
        /** slc1_txlink_auto_ret : R/W; bitpos: [27]; default: 1;
         *  enable the function that when host sending packet retries, dma channel1 will
         *  automatically jump to the start descriptor of the previous packet.
         */
        uint32_t slc1_txlink_auto_ret:1;
        /** slc1_txdscr_burst_en : R/W; bitpos: [28]; default: 1;
         *  0- AHB burst type is single when dma channel1 fetches linked list for receiving
         *  data, 1-AHB burst type is not single when dma channel1 fetches linked list for
         *  receiving data
         */
        uint32_t slc1_txdscr_burst_en:1;
        /** slc1_txdata_burst_en : R/W; bitpos: [29]; default: 1;
         *  0- AHB burst type is single when slave sends data to memory through dma channel1,
         *  1-AHB burst type is not single when slave sends data to memory through dma channel1.
         */
        uint32_t slc1_txdata_burst_en:1;
        uint32_t reserved_30:1;
        /** slc1_token_sel : R/W; bitpos: [31]; default: 1;
         *  reserved
         */
        uint32_t slc1_token_sel:1;
    };
    uint32_t val;
} sdio_slc_conf0_reg_t;

/** Type of slc_slc0rxfifo_push register
 *  Sdio slave DMA channel0 rxfifo debug register.
 */
typedef union {
    struct {
        /** slc0_rxfifo_wdata : R/W; bitpos: [8:0]; default: 0;
         *  The data used to sent into rxfifo through APB bus.
         */
        uint32_t slc0_rxfifo_wdata:9;
        uint32_t reserved_9:7;
        /** slc0_rxfifo_push : R/W/SC; bitpos: [16]; default: 0;
         *  Set this bit to send slc0_rxfifo_wdata into rxfifo through APB bus. This bit is
         *  cleared automatically after sending one data to slc0_rxfifo through APB bus
         *  successfully.
         */
        uint32_t slc0_rxfifo_push:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} sdio_slc_slc0rxfifo_push_reg_t;

/** Type of slc_slc1rxfifo_push register
 *  Sdio slave DMA channel1 rxfifo debug register.
 */
typedef union {
    struct {
        /** slc1_rxfifo_wdata : R/W; bitpos: [8:0]; default: 0;
         *  The data used to sent into rxfifo through APB bus.
         */
        uint32_t slc1_rxfifo_wdata:9;
        uint32_t reserved_9:7;
        /** slc1_rxfifo_push : R/W/SC; bitpos: [16]; default: 0;
         *  Set this bit to send slc1_rxfifo_wdata into rxfifo through APB bus. This bit is
         *  cleared automatically after sending one data to slc1_rxfifo through APB bus
         *  successfully.
         */
        uint32_t slc1_rxfifo_push:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} sdio_slc_slc1rxfifo_push_reg_t;

/** Type of slc_slc0rx_link register
 *  Sdio slave DMA channel0 configuration and status register of link list for slave
 *  sending data.
 */
typedef union {
    struct {
        uint32_t reserved_0:28;
        /** slc0_rxlink_stop : R/W/SC; bitpos: [28]; default: 0;
         *  Set 1 to stop the linked list operation for dma channel0 sending packets.
         */
        uint32_t slc0_rxlink_stop:1;
        /** slc0_rxlink_start : R/W/SC; bitpos: [29]; default: 0;
         *  Set 1 to start the linked list operation for dma channel0 sending packets. Sending
         *  will start from address indicated by SLC0_RXLINK_ADDR.
         */
        uint32_t slc0_rxlink_start:1;
        /** slc0_rxlink_restart : R/W/SC; bitpos: [30]; default: 0;
         *  Set 1 to restart and continue the linked list operation for dma channel0 sending
         *  packets.
         */
        uint32_t slc0_rxlink_restart:1;
        /** slc0_rxlink_park : RO; bitpos: [31]; default: 1;
         *  The status bit for sending link list fsm of dma channel0 in idle state
         */
        uint32_t slc0_rxlink_park:1;
    };
    uint32_t val;
} sdio_slc_slc0rx_link_reg_t;

