espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_struct.h
/** Type of slc_slc0rx_link_addr register
 *  Sdio slave DMA channel0 address of first descriptor of sending link list.
 */
typedef union {
    struct {
        /** slc0_rxlink_addr : R/W; bitpos: [31:0]; default: 0;
         *  The initial address of dma channel0's sending linked list.
         */
        uint32_t slc0_rxlink_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0rx_link_addr_reg_t;

/** Type of slc_slc0tx_link register
 *  Sdio slave DMA channel0 configuration and status register of link list for slave
 *  receiving data.
 */
typedef union {
    struct {
        uint32_t reserved_0:28;
        /** slc0_txlink_stop : R/W/SC; bitpos: [28]; default: 0;
         *  Set 1 to stop the linked list operation for dma channel0 receiving packets.
         */
        uint32_t slc0_txlink_stop:1;
        /** slc0_txlink_start : R/W/SC; bitpos: [29]; default: 0;
         *  Set 1 to start the linked list operation for dma channel0 receiving packets.
         *  Sending will start from address indicated by SLC0_TXLINK_ADDR.
         */
        uint32_t slc0_txlink_start:1;
        /** slc0_txlink_restart : R/W/SC; bitpos: [30]; default: 0;
         *  Set 1 to restart and continue the linked list operation for dma channel0 receiving
         *  packets.
         */
        uint32_t slc0_txlink_restart:1;
        /** slc0_txlink_park : RO; bitpos: [31]; default: 1;
         *  The status bit for receiving link list fsm of dma channel0 in idle state
         */
        uint32_t slc0_txlink_park:1;
    };
    uint32_t val;
} sdio_slc_slc0tx_link_reg_t;

/** Type of slc_slc0tx_link_addr register
 *  Sdio slave DMA channel0 address of first descriptor of receiving linked list.
 */
typedef union {
    struct {
        /** slc0_txlink_addr : R/W; bitpos: [31:0]; default: 0;
         *  The initial address of dma channel0's receiving linked list.
         */
        uint32_t slc0_txlink_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0tx_link_addr_reg_t;

/** Type of slc_slc1rx_link register
 *  Sdio slave DMA channel1 configuration and status register of link list for slave
 *  sending data.
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** slc1_bt_packet : R/W; bitpos: [20]; default: 1;
         *  Configure the packet type for slave to send: 0- wifi packet, 1- blue-tooth packet.
         */
        uint32_t slc1_bt_packet:1;
        uint32_t reserved_21:7;
        /** slc1_rxlink_stop : R/W/SC; bitpos: [28]; default: 0;
         *  Set 1 to stop the linked list operation for dma channel1 sending packets.
         */
        uint32_t slc1_rxlink_stop:1;
        /** slc1_rxlink_start : R/W/SC; bitpos: [29]; default: 0;
         *  Set 1 to start the linked list operation for dma channel1 sending packets. Sending
         *  will start from address indicated by SLC0_RXLINK_ADDR.
         */
        uint32_t slc1_rxlink_start:1;
        /** slc1_rxlink_restart : R/W/SC; bitpos: [30]; default: 0;
         *  Set 1 to restart and continue the linked list operation for dma channel1 sending
         *  packets.
         */
        uint32_t slc1_rxlink_restart:1;
        /** slc1_rxlink_park : RO; bitpos: [31]; default: 1;
         *  The status bit for sending link list fsm of dma channel1 in idle state
         */
        uint32_t slc1_rxlink_park:1;
    };
    uint32_t val;
} sdio_slc_slc1rx_link_reg_t;

/** Type of slc_slc1rx_link_addr register
 *  Sdio slave DMA channel1 address of first descriptor of sending link list.
 */
typedef union {
    struct {
        /** slc1_rxlink_addr : R/W; bitpos: [31:0]; default: 0;
         *  The initial address of dma channel1's sending linked list.
         */
        uint32_t slc1_rxlink_addr:32;
    };
    uint32_t val;
} sdio_slc_slc1rx_link_addr_reg_t;

/** Type of slc_slc1tx_link register
 *  Sdio slave DMA channel1 configuration and status register of link list for slave
 *  receiving data.
 */
typedef union {
    struct {
        uint32_t reserved_0:28;
        /** slc1_txlink_stop : R/W/SC; bitpos: [28]; default: 0;
         *  Set 1 to stop the linked list operation for dma channel1 receiving packets.
         */
        uint32_t slc1_txlink_stop:1;
        /** slc1_txlink_start : R/W/SC; bitpos: [29]; default: 0;
         *  Set 1 to start the linked list operation for dma channel1 receiving packets.
         *  Sending will start from address indicated by SLC0_TXLINK_ADDR.
         */
        uint32_t slc1_txlink_start:1;
        /** slc1_txlink_restart : R/W/SC; bitpos: [30]; default: 0;
         *  Set 1 to restart and continue the linked list operation for dma channel1 receiving
         *  packets.
         */
        uint32_t slc1_txlink_restart:1;
        /** slc1_txlink_park : RO; bitpos: [31]; default: 1;
         *  The status bit for receiving link list fsm of dma channel1 in idle state
         */
        uint32_t slc1_txlink_park:1;
    };
    uint32_t val;
} sdio_slc_slc1tx_link_reg_t;

/** Type of slc_slc1tx_link_addr register
 *  Sdio slave DMA channel1 address of first descriptor of receiving linked list.
 */
typedef union {
    struct {
        /** slc1_txlink_addr : R/W; bitpos: [31:0]; default: 0;
         *  The initial address of dma channel1's receiving linked list.
         */
        uint32_t slc1_txlink_addr:32;
    };
    uint32_t val;
} sdio_slc_slc1tx_link_addr_reg_t;

/** Type of slc_slcintvec_tohost register
 *  Sdio slave DMA channel0 address of first descriptor of receiving linked list.
 */
typedef union {
    struct {
        /** slc0_tohost_intvec : WT; bitpos: [7:0]; default: 0;
         *  The interrupt vector for slave to interrupt host through dma channel0.
         */
        uint32_t slc0_tohost_intvec:8;
        uint32_t reserved_8:8;
        /** slc1_tohost_intvec : WT; bitpos: [23:16]; default: 0;
         *  The interrupt vector for slave to interrupt host through dma channel1.
         */
        uint32_t slc1_tohost_intvec:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} sdio_slc_slcintvec_tohost_reg_t;

/** Type of slc_slc0token0 register
 *  Sdio slave DMA channel0 receiving buffer configuration and status register.
 */
typedef union {
    struct {
        /** slc0_token0_wdata : WT; bitpos: [11:0]; default: 0;
         *  The number of available receiving buffers.
         */
        uint32_t slc0_token0_wdata:12;
        /** slc0_token0_wr : WT; bitpos: [12]; default: 0;
         *  update slc0_token0_wdata into slc0 token0.
         */
        uint32_t slc0_token0_wr:1;
        /** slc0_token0_inc : WT; bitpos: [13]; default: 0;
         *  Add 1 to slc0_token0.
         */
        uint32_t slc0_token0_inc:1;
        /** slc0_token0_inc_more : WT; bitpos: [14]; default: 0;
         *  Set this bit to add the value of SDIO_SLC0TOKEN0_SLC0_TOKEN0_WDATA to
         *  SDIO_SLC0TOKEN0_SLC0_TOKEN0.
         */
        uint32_t slc0_token0_inc_more:1;
        uint32_t reserved_15:1;
        /** slc0_token0 : RO; bitpos: [27:16]; default: 0;
         *  The accumulated number of buffers for receiving packets through dma channel0.
         */
        uint32_t slc0_token0:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} sdio_slc_slc0token0_reg_t;

/** Type of slc_slc0token1 register
 *  Sdio slave DMA channel0 receiving buffer configuration and status register1.
 */
typedef union {
    struct {
        /** slc0_token1_wdata : WT; bitpos: [11:0]; default: 0;
         *  The number of available receiving buffers.
         */
        uint32_t slc0_token1_wdata:12;
        /** slc0_token1_wr : WT; bitpos: [12]; default: 0;
         *  update slc0_token1_wdata into slc0 token1
         */
        uint32_t slc0_token1_wr:1;
        /** slc0_token1_inc : WT; bitpos: [13]; default: 0;
         *  slc0_token1 becomes to 1 when auto clear slc0_token1, else add 1 to slc0_token1
         */
        uint32_t slc0_token1_inc:1;
        /** slc0_token1_inc_more : WT; bitpos: [14]; default: 0;
         *  Set this bit to add the value of SDIO_SLC0TOKEN1_SLC0_TOKEN1_WDATA to
         *  SDIO_SLC0TOKEN1_SLC0_TOKEN1.
         */
        uint32_t slc0_token1_inc_more:1;
        uint32_t reserved_15:1;
        /** slc0_token1 : RO; bitpos: [27:16]; default: 0;
         *  The accumulated number of buffers for receiving packets through dma channel0.
         */
        uint32_t slc0_token1:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} sdio_slc_slc0token1_reg_t;

/** Type of slc_slc1token0 register
 *  Sdio slave DMA channel1 receiving buffer configuration and status register.
 */
typedef union {
    struct {
        /** slc1_token0_wdata : WT; bitpos: [11:0]; default: 0;
         *  The number of available receiving buffers.
         */
        uint32_t slc1_token0_wdata:12;
        /** slc1_token0_wr : WT; bitpos: [12]; default: 0;
         *  update SLC1_token0_wdata into SLC1 token0.
         */
        uint32_t slc1_token0_wr:1;
        /** slc1_token0_inc : WT; bitpos: [13]; default: 0;
         *  Add 1 to SLC1_token0.
         */
        uint32_t slc1_token0_inc:1;
        /** slc1_token0_inc_more : WT; bitpos: [14]; default: 0;
         *  Set this bit to add the value of SDIO_SLC1TOKEN0_SLC1_TOKEN0_WDATA to
         *  SDIO_SLC1TOKEN0_SLC1_TOKEN0.
         */
        uint32_t slc1_token0_inc_more:1;
        uint32_t reserved_15:1;
        /** slc1_token0 : RO; bitpos: [27:16]; default: 0;
         *  The accumulated number of buffers for receiving packets through dma channel1.
         */
        uint32_t slc1_token0:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} sdio_slc_slc1token0_reg_t;

