espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_struct.h
/** Type of slc_slc1token1 register
 *  Sdio slave DMA channel1 receiving buffer configuration and status register1.
 */
typedef union {
    struct {
        /** slc1_token1_wdata : WT; bitpos: [11:0]; default: 0;
         *  The number of available receiving buffers.
         */
        uint32_t slc1_token1_wdata:12;
        /** slc1_token1_wr : WT; bitpos: [12]; default: 0;
         *  update SLC1_token1_wdata into SLC1 token1
         */
        uint32_t slc1_token1_wr:1;
        /** slc1_token1_inc : WT; bitpos: [13]; default: 0;
         *  SLC1_token1 becomes to 1 when auto clear SLC1_token1, else add 1 to SLC1_token1
         */
        uint32_t slc1_token1_inc:1;
        /** slc1_token1_inc_more : WT; bitpos: [14]; default: 0;
         *  Set this bit to add the value of SDIO_SLC1TOKEN1_SLC1_TOKEN1_WDATA to
         *  SDIO_SLC1TOKEN1_SLC1_TOKEN1.
         */
        uint32_t slc1_token1_inc_more:1;
        uint32_t reserved_15:1;
        /** slc1_token1 : RO; bitpos: [27:16]; default: 0;
         *  The accumulated number of buffers for receiving packets through dma channel1.
         */
        uint32_t slc1_token1:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} sdio_slc_slc1token1_reg_t;

/** Type of slc_conf1 register
 *  Sdio slave DMA configuration1 register.
 */
typedef union {
    struct {
        /** slc0_check_owner : R/W; bitpos: [0]; default: 0;
         *  Set 1 to check the owner bit of descriptors  used by dma channel0.
         */
        uint32_t slc0_check_owner:1;
        /** slc0_tx_check_sum_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to enable check sum function during slave receiving packets through dma
         *  channel0.
         */
        uint32_t slc0_tx_check_sum_en:1;
        /** slc0_rx_check_sum_en : R/W; bitpos: [2]; default: 0;
         *  Set 1 to enable check sum function during slave sending packets through dma
         *  channel0.
         */
        uint32_t slc0_rx_check_sum_en:1;
        /** sdio_cmd_hold_en : R/W; bitpos: [3]; default: 1;
         *  Allow host to send another cmd53 during last cmd53 operating time.
         */
        uint32_t sdio_cmd_hold_en:1;
        /** slc0_len_auto_clr : R/W; bitpos: [4]; default: 1;
         *  Set 1 to automatically clear the length of buffers used to send packets ot host
         *  after host reads this length. (not recommended to use,should be set to 0)
         */
        uint32_t slc0_len_auto_clr:1;
        /** slc0_tx_stitch_en : R/W; bitpos: [5]; default: 1;
         *  Set 1 to enable the stitch mode of dma channel0 receiving linked list .
         */
        uint32_t slc0_tx_stitch_en:1;
        /** slc0_rx_stitch_en : R/W; bitpos: [6]; default: 1;
         *  Set 1 to enable the stitch mode of dma channel0 sending linked list .
         */
        uint32_t slc0_rx_stitch_en:1;
        uint32_t reserved_7:9;
        /** slc1_check_owner : R/W; bitpos: [16]; default: 0;
         *  Set 1 to check the owner bit of descriptors  used by dma channel1.
         */
        uint32_t slc1_check_owner:1;
        /** slc1_tx_check_sum_en : R/W; bitpos: [17]; default: 0;
         *  Set 1 to enable check sum function during slave receiving packets through dma
         *  channel1.
         */
        uint32_t slc1_tx_check_sum_en:1;
        /** slc1_rx_check_sum_en : R/W; bitpos: [18]; default: 0;
         *  Set 1 to enable check sum function during slave sending packets through dma
         *  channel1.
         */
        uint32_t slc1_rx_check_sum_en:1;
        /** host_int_level_sel : R/W; bitpos: [19]; default: 0;
         *  Set the polarity of interrupt generated to host: 0-low active, 1-high active.
         */
        uint32_t host_int_level_sel:1;
        uint32_t reserved_20:2;
        /** sdio_clk_en : R/W; bitpos: [22]; default: 0;
         *  Sdio slave dma registers' clock gating enable bit: 0-the sdio slave dma registers'
         *  clock is on  during apb operation, 1- the sdio slave dma registers' clock is always
         *  on.
         */
        uint32_t sdio_clk_en:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} sdio_slc_conf1_reg_t;

/** Type of slc_bridge_conf register
 *  Sdio slave DMA bridge configuration register.
 */
typedef union {
    struct {
        /** slc_txeof_ena : R/W; bitpos: [5:0]; default: 32;
         *  Configure the end-of-frame address of receiving packet. The priority from high to
         *  low is: if txeof_ena[0] is 1, end-of-frame address is 0xfff,  if txeof_ena[1] is 1,
         *  end-of-frame address is 0x1fff, if txeof_ena[2] is 1, end-of-frame address is
         *  0x3fff, if txeof_ena[3] is 1, end-of-frame address is 0x7fff, if txeof_ena[4] is 1,
         *  end-of-frame address is 0xffff, if txeof_ena[5] is 1, end-of-frame address is
         *  0x1f7ff. Make sure the end-of-frame address is within the address range set by
         *  fifo_map_ena, otherwise the packet will be transferred without end-of-frame flag,
         *  which can cause unpredictable consequence.
         */
        uint32_t slc_txeof_ena:6;
        uint32_t reserved_6:2;
        /** slc_fifo_map_ena : R/W; bitpos: [11:8]; default: 7;
         *  Configure the address range allocated to transfer packets using SDIO func1 and
         *  func2. The address range is from 0x400 to 0-0x3fff, 1-0x7fff, 3-0xffff, 7-0x1ffff,
         *  others-not allowed.
         */
        uint32_t slc_fifo_map_ena:4;
        /** slc0_tx_dummy_mode : R/W; bitpos: [12]; default: 1;
         *  Set 1 not to transfer check sum data into memory through dma channel0.
         */
        uint32_t slc0_tx_dummy_mode:1;
        /** slc_hda_map_128k : R/W; bitpos: [13]; default: 1;
         *  If hda_map_128k is 0, map high 4 bit address to hda_4msb. When hda_map_128k is 1,
         *  if hda_word_en (slchost_conf12[0]) is 0, map high 4 bit address to {hda_4msb[3:1],
         *  addr_ext_func[16]}. Else if hda_word_en is 1, map high 4 bit address to
         *  {hda_4msb[3:1], addr_ext_func[14]}.
         */
        uint32_t slc_hda_map_128k:1;
        /** slc1_tx_dummy_mode : R/W; bitpos: [14]; default: 1;
         *  Set 1 not to transfer check sum data into memory through dma channel1.
         */
        uint32_t slc1_tx_dummy_mode:1;
        uint32_t reserved_15:1;
        /** slc_tx_push_idle_num : R/W; bitpos: [31:16]; default: 10;
         *  reserved
         */
        uint32_t slc_tx_push_idle_num:16;
    };
    uint32_t val;
} sdio_slc_bridge_conf_reg_t;

/** Type of slc_slc0_to_eof_des_addr register
 *  Sdio slave DMA channel0 start address of sending linked list register.
 */
typedef union {
    struct {
        /** slc0_to_eof_des_addr : RO; bitpos: [31:0]; default: 0;
         *  The descriptor address of the last sent packet through dma channel0.
         */
        uint32_t slc0_to_eof_des_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_to_eof_des_addr_reg_t;

/** Type of slc_slc0_tx_eof_des_addr register
 *  Sdio slave DMA channel0 receiving packet status register.
 */
typedef union {
    struct {
        /** slc0_tx_suc_eof_des_addr : RO; bitpos: [31:0]; default: 0;
         *  The descriptor address of the last successfully received packet through dma
         *  channel0.
         */
        uint32_t slc0_tx_suc_eof_des_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_tx_eof_des_addr_reg_t;

/** Type of slc_slc0_to_eof_bfr_des_addr register
 *  Sdio slave DMA channel0 start address of sending linked list register.
 */
typedef union {
    struct {
        /** slc0_to_eof_bfr_des_addr : RO; bitpos: [31:0]; default: 0;
         *  The descriptor address of the last successfully sent buffer packet through dma
         *  channel0.
         */
        uint32_t slc0_to_eof_bfr_des_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_to_eof_bfr_des_addr_reg_t;

