espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_struct.h
/** Type of slc_slc1_to_eof_des_addr register
 *  Sdio slave DMA channel1 start address of sending linked list register.
 */
typedef union {
    struct {
        /** slc1_to_eof_des_addr : RO; bitpos: [31:0]; default: 0;
         *  The descriptor address of the last sent packet through dma channel1.
         */
        uint32_t slc1_to_eof_des_addr:32;
    };
    uint32_t val;
} sdio_slc_slc1_to_eof_des_addr_reg_t;

/** Type of slc_slc1_tx_eof_des_addr register
 *  Sdio slave DMA channel1 receiving packet status register.
 */
typedef union {
    struct {
        /** slc1_tx_suc_eof_des_addr : RO; bitpos: [31:0]; default: 0;
         *  The descriptor address of the last successfully received packet through dma
         *  channel1.
         */
        uint32_t slc1_tx_suc_eof_des_addr:32;
    };
    uint32_t val;
} sdio_slc_slc1_tx_eof_des_addr_reg_t;

/** Type of slc_slc1_to_eof_bfr_des_addr register
 *  Sdio slave DMA channel1 start address of sending linked list register.
 */
typedef union {
    struct {
        /** slc1_to_eof_bfr_des_addr : RO; bitpos: [31:0]; default: 0;
         *  The descriptor address of the last successfully sent buffer packet through dma
         *  channel1.
         */
        uint32_t slc1_to_eof_bfr_des_addr:32;
    };
    uint32_t val;
} sdio_slc_slc1_to_eof_bfr_des_addr_reg_t;

/** Type of slc_rx_dscr_conf register
 *  Sdio slave sending descriptor configuration register.
 */
typedef union {
    struct {
        /** slc0_token_no_replace : R/W; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t slc0_token_no_replace:1;
        /** slc0_infor_no_replace : R/W; bitpos: [1]; default: 1;
         *  reserved
         */
        uint32_t slc0_infor_no_replace:1;
        /** slc0_rx_fill_mode : R/W; bitpos: [2]; default: 0;
         *  slc0 rx pop end control: 0-automatically end when pop finish, 1- end when the next
         *  pop doesn't occur after 255 cycles since the current pop
         */
        uint32_t slc0_rx_fill_mode:1;
        /** slc0_rx_eof_mode : R/W; bitpos: [3]; default: 1;
         *  0-slc0 rx_push_eof, 1-slc0 rx_pop_eof
         */
        uint32_t slc0_rx_eof_mode:1;
        /** slc0_rx_fill_en : R/W; bitpos: [4]; default: 1;
         *  reserved
         */
        uint32_t slc0_rx_fill_en:1;
        /** slc0_rd_retry_threshold : R/W; bitpos: [15:5]; default: 128;
         *  reserved
         */
        uint32_t slc0_rd_retry_threshold:11;
        /** slc1_token_no_replace : R/W; bitpos: [16]; default: 1;
         *  reserved
         */
        uint32_t slc1_token_no_replace:1;
        /** slc1_infor_no_replace : R/W; bitpos: [17]; default: 1;
         *  reserved
         */
        uint32_t slc1_infor_no_replace:1;
        /** slc1_rx_fill_mode : R/W; bitpos: [18]; default: 0;
         *  slc1 rx pop end control: 0-automatically end when pop finish, 1- end when the next
         *  pop doesn't occur after 255 cycles since the current pop
         */
        uint32_t slc1_rx_fill_mode:1;
        /** slc1_rx_eof_mode : R/W; bitpos: [19]; default: 1;
         *  0-slc1 rx_push_eof, 1-slc1 rx_pop_eof
         */
        uint32_t slc1_rx_eof_mode:1;
        /** slc1_rx_fill_en : R/W; bitpos: [20]; default: 1;
         *  reserved
         */
        uint32_t slc1_rx_fill_en:1;
        /** slc1_rd_retry_threshold : R/W; bitpos: [31:21]; default: 128;
         *  reserved
         */
        uint32_t slc1_rd_retry_threshold:11;
    };
    uint32_t val;
} sdio_slc_rx_dscr_conf_reg_t;

/** Type of slc_tx_dscr_conf register
 *  reserved
 */
typedef union {
    struct {
        /** slc_wr_retry_threshold : R/W; bitpos: [10:0]; default: 128;
         *  reserved
         */
        uint32_t slc_wr_retry_threshold:11;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} sdio_slc_tx_dscr_conf_reg_t;

/** Type of slc_slc0_len_conf register
 *  reserved
 */
typedef union {
    struct {
        /** slc0_len_wdata : WT; bitpos: [19:0]; default: 0;
         *  The packet length sent by dma channel0.
         */
        uint32_t slc0_len_wdata:20;
        /** slc0_len_wr : WT; bitpos: [20]; default: 0;
         *  Set this bit to set SLC0_LEN as SDIO_SLC0_LEN_WDATA.
         */
        uint32_t slc0_len_wr:1;
        /** slc0_len_inc : WT; bitpos: [21]; default: 0;
         *  Set this bit to add 1 to SLC0_LEN.
         */
        uint32_t slc0_len_inc:1;
        /** slc0_len_inc_more : WT; bitpos: [22]; default: 0;
         *  Set this bit to add the value of SDIO_SLC0_LEN_WDATA to SLC0_LEN.
         */
        uint32_t slc0_len_inc_more:1;
        /** slc0_rx_packet_load_en : WT; bitpos: [23]; default: 0;
         *  Write 1 to stitch new linked lists to current linked lists when dma channel0
         *  sending packets.
         */
        uint32_t slc0_rx_packet_load_en:1;
        /** slc0_tx_packet_load_en : WT; bitpos: [24]; default: 0;
         *  Write 1 to stitch new linked lists to current linked lists when dma channel0
         *  receiving packets.
         */
        uint32_t slc0_tx_packet_load_en:1;
        /** slc0_rx_get_used_dscr : WT; bitpos: [25]; default: 0;
         *  Write 1 to get the current descriptor address when dma channel0 sending packets.
         */
        uint32_t slc0_rx_get_used_dscr:1;
        /** slc0_tx_get_used_dscr : WT; bitpos: [26]; default: 0;
         *  Write 1 to get the current descriptor address when dma channel0 receiving packets.
         */
        uint32_t slc0_tx_get_used_dscr:1;
        /** slc0_rx_new_pkt_ind : RO; bitpos: [27]; default: 0;
         *  Represents a new packet is sent by dma channel0.
         */
        uint32_t slc0_rx_new_pkt_ind:1;
        /** slc0_tx_new_pkt_ind : RO; bitpos: [28]; default: 1;
         *  Represents a new packet is received by dma channel0.
         */
        uint32_t slc0_tx_new_pkt_ind:1;
        /** slc0_rx_packet_load_en_st : R/WTC/SC; bitpos: [29]; default: 0;
         *  Represents whether the dma channel0 can be stitched to new linked lists when
         *  sending packets. 0- allowed, 1- not allowed.
         */
        uint32_t slc0_rx_packet_load_en_st:1;
        /** slc0_tx_packet_load_en_st : R/WTC/SC; bitpos: [30]; default: 0;
         *  Represents whether the dma channel0 can be stitched to new linked lists when
         *  receiving packets. 0- allowed, 1- not allowed.
         */
        uint32_t slc0_tx_packet_load_en_st:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} sdio_slc_slc0_len_conf_reg_t;

/** Type of slc_slc0_txpkt_h_dscr register
 *  Sdio slave DMA channel0 start address of receiving linked list register.
 */
typedef union {
    struct {
        /** slc0_tx_pkt_h_dscr_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configure the start address of receiving linked list to be stitched to the current
         *  linked list of dma channel0.
         */
        uint32_t slc0_tx_pkt_h_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_txpkt_h_dscr_reg_t;

/** Type of slc_slc0_txpkt_e_dscr register
 *  Sdio slave DMA channel0 end address of receiving linked list register.
 */
typedef union {
    struct {
        /** slc0_tx_pkt_e_dscr_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configure end address of receiving linked list to be stitched to the current linked
         *  list of dma channel0.
         */
        uint32_t slc0_tx_pkt_e_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_txpkt_e_dscr_reg_t;

/** Type of slc_slc0_rxpkt_h_dscr register
 *  Sdio slave DMA channel0 start address of sending linked list register.
 */
typedef union {
    struct {
        /** slc0_rx_pkt_h_dscr_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configure the start address of sending linked list to be stitched to the current
         *  linked list of dma channel0.
         */
        uint32_t slc0_rx_pkt_h_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_rxpkt_h_dscr_reg_t;

/** Type of slc_slc0_rxpkt_e_dscr register
 *  Sdio slave DMA channel0 end address of sending linked list register.
 */
typedef union {
    struct {
        /** slc0_rx_pkt_e_dscr_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configure the end address of sending linked list to be stitched to the current
         *  linked list of dma channel0.
         */
        uint32_t slc0_rx_pkt_e_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_rxpkt_e_dscr_reg_t;

/** Type of slc_slc0_txpktu_h_dscr register
 *  Sdio slave DMA channel0 start address of receiving linked list status register.
 */
typedef union {
    struct {
        /** slc0_tx_pkt_start_dscr_addr : RO; bitpos: [31:0]; default: 0;
         *  The start address of the linked list of the last received packet through dma
         *  channel0.
         */
        uint32_t slc0_tx_pkt_start_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_txpktu_h_dscr_reg_t;

/** Type of slc_slc0_txpktu_e_dscr register
 *  Sdio slave DMA channel0 end address of receiving linked list status register.
 */
typedef union {
    struct {
        /** slc0_tx_pkt_end_dscr_addr : RO; bitpos: [31:0]; default: 0;
         *  The end address of the linked list of the last received packet through dma channel0.
         */
        uint32_t slc0_tx_pkt_end_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_txpktu_e_dscr_reg_t;

/** Type of slc_slc0_rxpktu_h_dscr register
 *  Sdio slave DMA channel0 start address of sending linked list status register.
 */
typedef union {
    struct {
        /** slc0_rx_pkt_start_dscr_addr : RO; bitpos: [31:0]; default: 0;
         *  The start address of the linked list of the last sent packet through dma channel0.
         */
        uint32_t slc0_rx_pkt_start_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_rxpktu_h_dscr_reg_t;

/** Type of slc_slc0_rxpktu_e_dscr register
 *  Sdio slave DMA channel0 end address of sending linked list status register.
 */
typedef union {
    struct {
        /** slc0_rx_pkt_end_dscr_addr : RO; bitpos: [31:0]; default: 0;
         *  The end address of the linked list of the last sent packet through dma channel0.
         */
        uint32_t slc0_rx_pkt_end_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_rxpktu_e_dscr_reg_t;

