espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_struct.h
/** Type of slc_seq_position register
 *  The position of receiving packet configuration register.
 */
typedef union {
    struct {
        /** slc0_seq_position : R/W; bitpos: [7:0]; default: 9;
         *  Configure the position of the receiving packet through dma channel0.
         */
        uint32_t slc0_seq_position:8;
        /** slc1_seq_position : R/W; bitpos: [15:8]; default: 5;
         *  Configure the position of the receiving packet through dma channel1.
         */
        uint32_t slc1_seq_position:8;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} sdio_slc_seq_position_reg_t;

/** Type of slc_slc0_dscr_rec_conf register
 *  Sdio slave DMA sending linked list limit configuration register.
 */
typedef union {
    struct {
        /** slc0_rx_dscr_rec_lim : R/W; bitpos: [9:0]; default: 1023;
         *  Configure the limit number of descriptors used to send one packet through dma
         *  channel0 in stitch mode.
         */
        uint32_t slc0_rx_dscr_rec_lim:10;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} sdio_slc_slc0_dscr_rec_conf_reg_t;

/** Type of slc_sdio_crc_st1 register
 *  Sdio slave receiving command crc status register.
 */
typedef union {
    struct {
        /** cmd_crc_err_cnt : RO; bitpos: [7:0]; default: 0;
         *  The count value of received command crc errors.
         */
        uint32_t cmd_crc_err_cnt:8;
        uint32_t reserved_8:23;
        /** err_cnt_clr : R/W; bitpos: [31]; default: 0;
         *  Set 1 to clear the cmd_crc_err_cnt, dat0_crc_err_cnt, dat1_crc_err_cnt,
         *  dat2_crc_err_cnt and dat3_crc_err_cnt.
         */
        uint32_t err_cnt_clr:1;
    };
    uint32_t val;
} sdio_slc_sdio_crc_st1_reg_t;

/** Type of slc_slc0_len_lim_conf register
 *  Sdio slave DMA channel0 buffer limit configuration register.
 */
typedef union {
    struct {
        /** slc0_len_lim : R/W; bitpos: [19:0]; default: 21504;
         *  Every time when the number of buffers loaded for sending packets reaches the number
         *  of slc0_len_lim, the current number of buffers loaded is saved into the registers
         *  of slc0_len0, slc0_len1 and slc0_len2.
         */
        uint32_t slc0_len_lim:20;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sdio_slc_slc0_len_lim_conf_reg_t;

/** Type of slc_slc0_tx_sharemem_start register
 *  Sdio slave DMA channel0 address range of receiving linked list register.
 */
typedef union {
    struct {
        /** sdio_slc0_tx_sharemem_start_addr : R/W; bitpos: [31:0]; default: 0;
         *  The start address boundary of descriptor can be used to receive packet through dma
         *  channel0.
         */
        uint32_t sdio_slc0_tx_sharemem_start_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_tx_sharemem_start_reg_t;

/** Type of slc_slc0_tx_sharemem_end register
 *  Sdio slave DMA channel0 address range of receiving linked list register1.
 */
typedef union {
    struct {
        /** sdio_slc0_tx_sharemem_end_addr : R/W; bitpos: [31:0]; default: 4294967295;
         *  The end address boundary of descriptor can be used to receive packet through dma
         *  channel0.
         */
        uint32_t sdio_slc0_tx_sharemem_end_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_tx_sharemem_end_reg_t;

/** Type of slc_slc0_rx_sharemem_start register
 *  Sdio slave DMA channel0 address range of sending linked list register.
 */
typedef union {
    struct {
        /** sdio_slc0_rx_sharemem_start_addr : R/W; bitpos: [31:0]; default: 0;
         *  The start address boundary of descriptor can be used to send packet through dma
         *  channel0.
         */
        uint32_t sdio_slc0_rx_sharemem_start_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_rx_sharemem_start_reg_t;

/** Type of slc_slc0_rx_sharemem_end register
 *  Sdio slave DMA channel0 address range of sending linked list register1.
 */
typedef union {
    struct {
        /** sdio_slc0_rx_sharemem_end_addr : R/W; bitpos: [31:0]; default: 4294967295;
         *  The end address boundary of descriptor can be used to send packet through dma
         *  channel0.
         */
        uint32_t sdio_slc0_rx_sharemem_end_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_rx_sharemem_end_reg_t;

/** Type of slc_slc1_tx_sharemem_start register
 *  Sdio slave DMA channel1 address range of receiving linked list register.
 */
typedef union {
    struct {
        /** sdio_slc1_tx_sharemem_start_addr : R/W; bitpos: [31:0]; default: 0;
         *  The start address boundary of descriptor can be used to receive packet through dma
         *  channel1.
         */
        uint32_t sdio_slc1_tx_sharemem_start_addr:32;
    };
    uint32_t val;
} sdio_slc_slc1_tx_sharemem_start_reg_t;

/** Type of slc_slc1_tx_sharemem_end register
 *  Sdio slave DMA channel1 address range of receiving linked list register1.
 */
typedef union {
    struct {
        /** sdio_slc1_tx_sharemem_end_addr : R/W; bitpos: [31:0]; default: 4294967295;
         *  The end address boundary of descriptor can be used to receive packet through dma
         *  channel1.
         */
        uint32_t sdio_slc1_tx_sharemem_end_addr:32;
    };
    uint32_t val;
} sdio_slc_slc1_tx_sharemem_end_reg_t;

/** Type of slc_slc1_rx_sharemem_start register
 *  Sdio slave DMA channel1 address range of sending linked list register.
 */
typedef union {
    struct {
        /** sdio_slc1_rx_sharemem_start_addr : R/W; bitpos: [31:0]; default: 0;
         *  The start address boundary of descriptor can be used to send packet through dma
         *  channel1.
         */
        uint32_t sdio_slc1_rx_sharemem_start_addr:32;
    };
    uint32_t val;
} sdio_slc_slc1_rx_sharemem_start_reg_t;

/** Type of slc_slc1_rx_sharemem_end register
 *  Sdio slave DMA channel1 address range of sending linked list register1.
 */
typedef union {
    struct {
        /** sdio_slc1_rx_sharemem_end_addr : R/W; bitpos: [31:0]; default: 4294967295;
         *  The end address boundary of descriptor can be used to send packet through dma
         *  channel1.
         */
        uint32_t sdio_slc1_rx_sharemem_end_addr:32;
    };
    uint32_t val;
} sdio_slc_slc1_rx_sharemem_end_reg_t;

