espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_struct.h
/** Type of slc_hda_tx_sharemem_start register
 *  Sdio slave HAD receiving address range register.
 */
typedef union {
    struct {
        /** sdio_hda_tx_sharemem_start_addr : R/W; bitpos: [31:0]; default: 0;
         *  Use 31 to 20 bit of this field as the higher 20 bits of 32-bit address for HAD
         *  receiving packets.
         */
        uint32_t sdio_hda_tx_sharemem_start_addr:32;
    };
    uint32_t val;
} sdio_slc_hda_tx_sharemem_start_reg_t;

/** Type of slc_hda_rx_sharemem_start register
 *  Sdio slave HAD sending address range register.
 */
typedef union {
    struct {
        /** sdio_hda_rx_sharemem_start_addr : R/W; bitpos: [31:0]; default: 0;
         *  Use 31 to 20 bit of this field as the higher 20 bits of 32-bit address for HAD
         *  sending packets.
         */
        uint32_t sdio_hda_rx_sharemem_start_addr:32;
    };
    uint32_t val;
} sdio_slc_hda_rx_sharemem_start_reg_t;

/** Type of slc_burst_len register
 *  Sdio slave AHB burst type configuration register.
 */
typedef union {
    struct {
        /** slc0_txdata_burst_len : R/W; bitpos: [0]; default: 1;
         *  AHB burst type: 0-incr4,1-incr8
         */
        uint32_t slc0_txdata_burst_len:1;
        /** slc0_rxdata_burst_len : R/W; bitpos: [1]; default: 1;
         *  AHB burst type: 0-incr4,1-incr8
         */
        uint32_t slc0_rxdata_burst_len:1;
        /** slc1_txdata_burst_len : R/W; bitpos: [2]; default: 1;
         *  AHB burst type: 0-incr4,1-incr8
         */
        uint32_t slc1_txdata_burst_len:1;
        /** slc1_rxdata_burst_len : R/W; bitpos: [3]; default: 1;
         *  AHB burst type: 0-incr4,1-incr8
         */
        uint32_t slc1_rxdata_burst_len:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} sdio_slc_burst_len_reg_t;


/** Group: Interrupt registers */
/** Type of slc_slc0int_raw register
 *  Sdio slave DMA channel0 raw interrupt status register.
 */
typedef union {
    struct {
        /** slc_frhost_bit0_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt bit 0 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit0_int_raw:1;
        /** slc_frhost_bit1_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt bit 1 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit1_int_raw:1;
        /** slc_frhost_bit2_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt bit 2 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit2_int_raw:1;
        /** slc_frhost_bit3_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt bit 3 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit3_int_raw:1;
        /** slc_frhost_bit4_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt bit 4 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit4_int_raw:1;
        /** slc_frhost_bit5_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt bit 5 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit5_int_raw:1;
        /** slc_frhost_bit6_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt bit 6 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit6_int_raw:1;
        /** slc_frhost_bit7_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw interrupt bit 7 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit7_int_raw:1;
        /** slc0_rx_start_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw interrupt bit of registering dma channel0 sending initialization
         */
        uint32_t slc0_rx_start_int_raw:1;
        /** slc0_tx_start_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  The raw interrupt bit of registering dma channel0 receiving initialization
         */
        uint32_t slc0_tx_start_int_raw:1;
        /** slc0_rx_udf_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  The raw interrupt bit of dma channel0 sending buffer underflow.
         */
        uint32_t slc0_rx_udf_int_raw:1;
        /** slc0_tx_ovf_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw interrupt bit of dma channel0 receiving buffer overflow.
         */
        uint32_t slc0_tx_ovf_int_raw:1;
        /** slc0_token0_1to0_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The raw interrupt bit for the value of slc0_token0 becoming to zero.
         */
        uint32_t slc0_token0_1to0_int_raw:1;
        /** slc0_token1_1to0_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  The raw interrupt bit for the value of slc0_token1 becoming to zero.
         */
        uint32_t slc0_token1_1to0_int_raw:1;
        /** slc0_tx_done_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  The raw interrupt bit of dma channel0 finishing receiving data to one single buffer.
         */
        uint32_t slc0_tx_done_int_raw:1;
        /** slc0_tx_suc_eof_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  The raw interrupt bit of dma channel0 finishing receiving data
         */
        uint32_t slc0_tx_suc_eof_int_raw:1;
        /** slc0_rx_done_int_raw : R/WTC/SS; bitpos: [16]; default: 0;
         *  The raw interrupt bit of dma channel0 finishing sending data from one single buffer
         */
        uint32_t slc0_rx_done_int_raw:1;
        /** slc0_rx_eof_int_raw : R/WTC/SS; bitpos: [17]; default: 0;
         *  The raw interrupt bit of dma channel0 finishing sending data
         */
        uint32_t slc0_rx_eof_int_raw:1;
        /** slc0_tohost_int_raw : R/WTC/SS; bitpos: [18]; default: 0;
         *  The raw interrupt bit for slave generating interrupt to host.
         */
        uint32_t slc0_tohost_int_raw:1;
        /** slc0_tx_dscr_err_int_raw : R/WTC/SS; bitpos: [19]; default: 0;
         *  The raw interrupt bit of dma channel0 receiving descriptor error.
         */
        uint32_t slc0_tx_dscr_err_int_raw:1;
        /** slc0_rx_dscr_err_int_raw : R/WTC/SS; bitpos: [20]; default: 0;
         *  The raw interrupt bit of dma channel0 sending descriptor error.
         */
        uint32_t slc0_rx_dscr_err_int_raw:1;
        /** slc0_tx_dscr_empty_int_raw : R/WTC/SS; bitpos: [21]; default: 0;
         *  The raw interrupt bit of  not enough buffer for slave receiving data from host
         *  through dma channel0.
         */
        uint32_t slc0_tx_dscr_empty_int_raw:1;
        /** slc0_host_rd_ack_int_raw : R/WTC/SS; bitpos: [22]; default: 0;
         *  The raw interrupt bit for host to acknowledge retrying receiving data from slave
         *  successfully through dma channel0.
         */
        uint32_t slc0_host_rd_ack_int_raw:1;
        /** slc0_wr_retry_done_int_raw : R/WTC/SS; bitpos: [23]; default: 0;
         *  The raw interrupt bit of host finishing retrying sending data to slave through dma
         *  channel0.
         */
        uint32_t slc0_wr_retry_done_int_raw:1;
        /** slc0_tx_err_eof_int_raw : R/WTC/SS; bitpos: [24]; default: 0;
         *  The raw interrupt bit of data error during host sending data to slave through dma
         *  channel0.
         */
        uint32_t slc0_tx_err_eof_int_raw:1;
        /** cmd_dtc_int_raw : R/WTC/SS; bitpos: [25]; default: 0;
         *  The raw interrupt bit for sdio slave to detect command from host.
         */
        uint32_t cmd_dtc_int_raw:1;
        /** slc0_rx_quick_eof_int_raw : R/WTC/SS; bitpos: [26]; default: 0;
         *  The raw interrupt for the linked list used reaches the number of
         *  slc0_rx_dscr_rec_lim when in stitch mode, or for every sending data transfer done.
         */
        uint32_t slc0_rx_quick_eof_int_raw:1;
        /** slc0_host_pop_eof_err_int_raw : R/WTC/SS; bitpos: [27]; default: 0;
         *  The raw interrupt bit for the eof bit error of slave receiving data through dma
         *  channel0.
         */
        uint32_t slc0_host_pop_eof_err_int_raw:1;
        /** hda_recv_done_int_raw : R/WTC/SS; bitpos: [28]; default: 0;
         *  The raw interrupt bit for slave finishes receiving one cmd53 function's all block
         *  data.
         */
        uint32_t hda_recv_done_int_raw:1;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} sdio_slc_slc0int_raw_reg_t;

/** Type of slc_slc0int_st register
 *  Sdio slave DMA channel0 masked interrupt status register.
 */
typedef union {
    struct {
        /** slc_frhost_bit0_int_st : RO; bitpos: [0]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT0_INT interrupt.
         */
        uint32_t slc_frhost_bit0_int_st:1;
        /** slc_frhost_bit1_int_st : RO; bitpos: [1]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT1_INT interrupt.
         */
        uint32_t slc_frhost_bit1_int_st:1;
        /** slc_frhost_bit2_int_st : RO; bitpos: [2]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT2_INT interrupt.
         */
        uint32_t slc_frhost_bit2_int_st:1;
        /** slc_frhost_bit3_int_st : RO; bitpos: [3]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT3_INT interrupt.
         */
        uint32_t slc_frhost_bit3_int_st:1;
        /** slc_frhost_bit4_int_st : RO; bitpos: [4]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT4_INT interrupt.
         */
        uint32_t slc_frhost_bit4_int_st:1;
        /** slc_frhost_bit5_int_st : RO; bitpos: [5]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT5_INT interrupt.
         */
        uint32_t slc_frhost_bit5_int_st:1;
        /** slc_frhost_bit6_int_st : RO; bitpos: [6]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT6_INT interrupt.
         */
        uint32_t slc_frhost_bit6_int_st:1;
        /** slc_frhost_bit7_int_st : RO; bitpos: [7]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT7_INT interrupt.
         */
        uint32_t slc_frhost_bit7_int_st:1;
        /** slc0_rx_start_int_st : RO; bitpos: [8]; default: 0;
         *  The masked interrupt status bit for SLC0_RX_START_INT_ST interrupt.
         */
        uint32_t slc0_rx_start_int_st:1;
        /** slc0_tx_start_int_st : RO; bitpos: [9]; default: 0;
         *  The masked interrupt status bit for SLC0_TX_START_INT_ST interrupt.
         */
        uint32_t slc0_tx_start_int_st:1;
        /** slc0_rx_udf_int_st : RO; bitpos: [10]; default: 0;
         *  The masked interrupt status bit for SLC0_RX_UDF_INT interrupt.
         */
        uint32_t slc0_rx_udf_int_st:1;
        /** slc0_tx_ovf_int_st : RO; bitpos: [11]; default: 0;
         *  The masked interrupt status bit for SLC0_TX_OVF_INT interrupt.
         */
        uint32_t slc0_tx_ovf_int_st:1;
        /** slc0_token0_1to0_int_st : RO; bitpos: [12]; default: 0;
         *  The masked interrupt status bit for SLC0_TOKEN0_1TO0_INT interrupt.
         */
        uint32_t slc0_token0_1to0_int_st:1;
        /** slc0_token1_1to0_int_st : RO; bitpos: [13]; default: 0;
         *  The masked interrupt status bit for SLC0_TOKEN1_1TO0_INT interrupt.
         */
        uint32_t slc0_token1_1to0_int_st:1;
        /** slc0_tx_done_int_st : RO; bitpos: [14]; default: 0;
         *  The masked interrupt status bit for SLC0_TX_DONE_INT_ST interrupt.
         */
        uint32_t slc0_tx_done_int_st:1;
        /** slc0_tx_suc_eof_int_st : RO; bitpos: [15]; default: 0;
         *  The masked interrupt status bit for SLC0_TX_SUC_EOF_INT interrupt.
         */
        uint32_t slc0_tx_suc_eof_int_st:1;
        /** slc0_rx_done_int_st : RO; bitpos: [16]; default: 0;
         *  The masked interrupt status bit for SLC0_RX_DONE_INT interrupt.
         */
        uint32_t slc0_rx_done_int_st:1;
        /** slc0_rx_eof_int_st : RO; bitpos: [17]; default: 0;
         *  The masked interrupt status bit for SLC0_RX_EOF_INT interrupt.
         */
        uint32_t slc0_rx_eof_int_st:1;
        /** slc0_tohost_int_st : RO; bitpos: [18]; default: 0;
         *  The masked interrupt status bit for SLC0_TOHOST_INT interrupt.
         */
        uint32_t slc0_tohost_int_st:1;
        /** slc0_tx_dscr_err_int_st : RO; bitpos: [19]; default: 0;
         *  The masked interrupt status bit for SLC0_TX_DSCR_ERR_INT interrupt.
         */
        uint32_t slc0_tx_dscr_err_int_st:1;
        /** slc0_rx_dscr_err_int_st : RO; bitpos: [20]; default: 0;
         *  The masked interrupt status bit for SLC0_RX_DSCR_ERR_INT interrupt.
         */
        uint32_t slc0_rx_dscr_err_int_st:1;
        /** slc0_tx_dscr_empty_int_st : RO; bitpos: [21]; default: 0;
         *  The masked interrupt status bit for SLC0_TX_DSCR_EMPTY_INT interrupt.
         */
        uint32_t slc0_tx_dscr_empty_int_st:1;
        /** slc0_host_rd_ack_int_st : RO; bitpos: [22]; default: 0;
         *  The masked interrupt status bit for SLC0_HOST_RD_ACK_INT interrupt.
         */
        uint32_t slc0_host_rd_ack_int_st:1;
        /** slc0_wr_retry_done_int_st : RO; bitpos: [23]; default: 0;
         *  The masked interrupt status bit for SLC0_WR_RETRY_DONE_INT interrupt.
         */
        uint32_t slc0_wr_retry_done_int_st:1;
        /** slc0_tx_err_eof_int_st : RO; bitpos: [24]; default: 0;
         *  The masked interrupt status bit for SLC0_TX_ERR_EOF_INT interrupt.
         */
        uint32_t slc0_tx_err_eof_int_st:1;
        /** cmd_dtc_int_st : RO; bitpos: [25]; default: 0;
         *  The masked interrupt status bit for CMD_DTC_INT interrupt.
         */
        uint32_t cmd_dtc_int_st:1;
        /** slc0_rx_quick_eof_int_st : RO; bitpos: [26]; default: 0;
         *  The masked interrupt status bit for SLC0_RX_QUICK_EOF_INT interrupt.
         */
        uint32_t slc0_rx_quick_eof_int_st:1;
        /** slc0_host_pop_eof_err_int_st : RO; bitpos: [27]; default: 0;
         *  The masked interrupt status bit for SLC0_HOST_POP_EOF_ERR_INT interrupt.
         */
        uint32_t slc0_host_pop_eof_err_int_st:1;
        /** hda_recv_done_int_st : RO; bitpos: [28]; default: 0;
         *  The masked interrupt status bit for HDA_RECV_DONE_INT interrupt.
         */
        uint32_t hda_recv_done_int_st:1;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} sdio_slc_slc0int_st_reg_t;

/** Type of slc_slc0int_ena register
 *  Sdio slave DMA channel0 interrupt enable register.
 */
typedef union {
    struct {
        /** slc_frhost_bit0_int_ena : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit for SLC_FRHOST_BIT0_INT interrupt.
         */
        uint32_t slc_frhost_bit0_int_ena:1;
        /** slc_frhost_bit1_int_ena : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit for SLC_FRHOST_BIT1_INT interrupt.
         */
        uint32_t slc_frhost_bit1_int_ena:1;
        /** slc_frhost_bit2_int_ena : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit for SLC_FRHOST_BIT2_INT interrupt.
         */
        uint32_t slc_frhost_bit2_int_ena:1;
        /** slc_frhost_bit3_int_ena : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit for SLC_FRHOST_BIT3_INT interrupt.
         */
        uint32_t slc_frhost_bit3_int_ena:1;
        /** slc_frhost_bit4_int_ena : R/W; bitpos: [4]; default: 0;
         *  The interrupt enable bit for SLC_FRHOST_BIT4_INT interrupt.
         */
        uint32_t slc_frhost_bit4_int_ena:1;
        /** slc_frhost_bit5_int_ena : R/W; bitpos: [5]; default: 0;
         *  The interrupt enable bit for SLC_FRHOST_BIT5_INT interrupt.
         */
        uint32_t slc_frhost_bit5_int_ena:1;
        /** slc_frhost_bit6_int_ena : R/W; bitpos: [6]; default: 0;
         *  The interrupt enable bit for SLC_FRHOST_BIT6_INT interrupt.
         */
        uint32_t slc_frhost_bit6_int_ena:1;
        /** slc_frhost_bit7_int_ena : R/W; bitpos: [7]; default: 0;
         *  The interrupt enable bit for SLC_FRHOST_BIT7_INT interrupt.
         */
        uint32_t slc_frhost_bit7_int_ena:1;
        /** slc0_rx_start_int_ena : R/W; bitpos: [8]; default: 0;
         *  The interrupt enable bit for SLC0_RX_START_INT_ST interrupt.
         */
        uint32_t slc0_rx_start_int_ena:1;
        /** slc0_tx_start_int_ena : R/W; bitpos: [9]; default: 0;
         *  The interrupt enable bit for SLC0_TX_START_INT_ST interrupt.
         */
        uint32_t slc0_tx_start_int_ena:1;
        /** slc0_rx_udf_int_ena : R/W; bitpos: [10]; default: 0;
         *  The interrupt enable bit for SLC0_RX_UDF_INT interrupt.
         */
        uint32_t slc0_rx_udf_int_ena:1;
        /** slc0_tx_ovf_int_ena : R/W; bitpos: [11]; default: 0;
         *  The interrupt enable bit for SLC0_TX_OVF_INT interrupt.
         */
        uint32_t slc0_tx_ovf_int_ena:1;
        /** slc0_token0_1to0_int_ena : R/W; bitpos: [12]; default: 0;
         *  The interrupt enable bit for SLC0_TOKEN0_1TO0_INT interrupt.
         */
        uint32_t slc0_token0_1to0_int_ena:1;
        /** slc0_token1_1to0_int_ena : R/W; bitpos: [13]; default: 0;
         *  The interrupt enable bit for SLC0_TOKEN1_1TO0_INT interrupt.
         */
        uint32_t slc0_token1_1to0_int_ena:1;
        /** slc0_tx_done_int_ena : R/W; bitpos: [14]; default: 0;
         *  The interrupt enable bit for SLC0_TX_DONE_INT_ST interrupt.
         */
        uint32_t slc0_tx_done_int_ena:1;
        /** slc0_tx_suc_eof_int_ena : R/W; bitpos: [15]; default: 0;
         *  The interrupt enable bit for SLC0_TX_SUC_EOF_INT interrupt.
         */
        uint32_t slc0_tx_suc_eof_int_ena:1;
        /** slc0_rx_done_int_ena : R/W; bitpos: [16]; default: 0;
         *  The interrupt enable bit for SLC0_RX_DONE_INT interrupt.
         */
        uint32_t slc0_rx_done_int_ena:1;
        /** slc0_rx_eof_int_ena : R/W; bitpos: [17]; default: 0;
         *  The interrupt enable bit for SLC0_RX_EOF_INT interrupt.
         */
        uint32_t slc0_rx_eof_int_ena:1;
        /** slc0_tohost_int_ena : R/W; bitpos: [18]; default: 0;
         *  The interrupt enable bit for SLC0_TOHOST_INT interrupt.
         */
        uint32_t slc0_tohost_int_ena:1;
        /** slc0_tx_dscr_err_int_ena : R/W; bitpos: [19]; default: 0;
         *  The interrupt enable bit for SLC0_TX_DSCR_ERR_INT interrupt.
         */
        uint32_t slc0_tx_dscr_err_int_ena:1;
        /** slc0_rx_dscr_err_int_ena : R/W; bitpos: [20]; default: 0;
         *  The interrupt enable bit for SLC0_RX_DSCR_ERR_INT interrupt.
         */
        uint32_t slc0_rx_dscr_err_int_ena:1;
        /** slc0_tx_dscr_empty_int_ena : R/W; bitpos: [21]; default: 0;
         *  The interrupt enable bit for SLC0_TX_DSCR_EMPTY_INT interrupt.
         */
        uint32_t slc0_tx_dscr_empty_int_ena:1;
        /** slc0_host_rd_ack_int_ena : R/W; bitpos: [22]; default: 0;
         *  The interrupt enable bit for SLC0_HOST_RD_ACK_INT interrupt.
         */
        uint32_t slc0_host_rd_ack_int_ena:1;
        /** slc0_wr_retry_done_int_ena : R/W; bitpos: [23]; default: 0;
         *  The interrupt enable bit for SLC0_WR_RETRY_DONE_INT interrupt.
         */
        uint32_t slc0_wr_retry_done_int_ena:1;
        /** slc0_tx_err_eof_int_ena : R/W; bitpos: [24]; default: 0;
         *  The interrupt enable bit for SLC0_TX_ERR_EOF_INT interrupt.
         */
        uint32_t slc0_tx_err_eof_int_ena:1;
        /** cmd_dtc_int_ena : R/W; bitpos: [25]; default: 0;
         *  The interrupt enable bit for CMD_DTC_INT interrupt.
         */
        uint32_t cmd_dtc_int_ena:1;
        /** slc0_rx_quick_eof_int_ena : R/W; bitpos: [26]; default: 0;
         *  The interrupt enable bit for SLC0_RX_QUICK_EOF_INT interrupt.
         */
        uint32_t slc0_rx_quick_eof_int_ena:1;
        /** slc0_host_pop_eof_err_int_ena : R/W; bitpos: [27]; default: 0;
         *  The interrupt enable bit for SLC0_HOST_POP_EOF_ERR_INT interrupt.
         */
        uint32_t slc0_host_pop_eof_err_int_ena:1;
        /** hda_recv_done_int_ena : R/W; bitpos: [28]; default: 0;
         *  The interrupt enable bit for HDA_RECV_DONE_INT interrupt.
         */
        uint32_t hda_recv_done_int_ena:1;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} sdio_slc_slc0int_ena_reg_t;

