espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_struct.h
/** Type of slc_slc0int_clr register
 *  Sdio slave DMA channel0 interrupt clear register.
 */
typedef union {
    struct {
        /** slc_frhost_bit0_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear SLC_FRHOST_BIT0_INT interrupt.
         */
        uint32_t slc_frhost_bit0_int_clr:1;
        /** slc_frhost_bit1_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear SLC_FRHOST_BIT1_INT interrupt.
         */
        uint32_t slc_frhost_bit1_int_clr:1;
        /** slc_frhost_bit2_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear SLC_FRHOST_BIT2_INT interrupt.
         */
        uint32_t slc_frhost_bit2_int_clr:1;
        /** slc_frhost_bit3_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear SLC_FRHOST_BIT3_INT interrupt.
         */
        uint32_t slc_frhost_bit3_int_clr:1;
        /** slc_frhost_bit4_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear SLC_FRHOST_BIT4_INT interrupt.
         */
        uint32_t slc_frhost_bit4_int_clr:1;
        /** slc_frhost_bit5_int_clr : WT; bitpos: [5]; default: 0;
         *  Set this bit to clear SLC_FRHOST_BIT5_INT interrupt.
         */
        uint32_t slc_frhost_bit5_int_clr:1;
        /** slc_frhost_bit6_int_clr : WT; bitpos: [6]; default: 0;
         *  Set this bit to clear SLC_FRHOST_BIT6_INT interrupt.
         */
        uint32_t slc_frhost_bit6_int_clr:1;
        /** slc_frhost_bit7_int_clr : WT; bitpos: [7]; default: 0;
         *  Set this bit to clear SLC_FRHOST_BIT7_INT interrupt.
         */
        uint32_t slc_frhost_bit7_int_clr:1;
        /** slc0_rx_start_int_clr : WT; bitpos: [8]; default: 0;
         *  Set this bit to clear SLC0_RX_START_INT_ST interrupt.
         */
        uint32_t slc0_rx_start_int_clr:1;
        /** slc0_tx_start_int_clr : WT; bitpos: [9]; default: 0;
         *  Set this bit to clear SLC0_TX_START_INT_ST interrupt.
         */
        uint32_t slc0_tx_start_int_clr:1;
        /** slc0_rx_udf_int_clr : WT; bitpos: [10]; default: 0;
         *  Set this bit to clear SLC0_RX_UDF_INT interrupt.
         */
        uint32_t slc0_rx_udf_int_clr:1;
        /** slc0_tx_ovf_int_clr : WT; bitpos: [11]; default: 0;
         *  Set this bit to clear SLC0_TX_OVF_INT interrupt.
         */
        uint32_t slc0_tx_ovf_int_clr:1;
        /** slc0_token0_1to0_int_clr : WT; bitpos: [12]; default: 0;
         *  Set this bit to clear SLC0_TOKEN0_1TO0_INT interrupt.
         */
        uint32_t slc0_token0_1to0_int_clr:1;
        /** slc0_token1_1to0_int_clr : WT; bitpos: [13]; default: 0;
         *  Set this bit to clear SLC0_TOKEN1_1TO0_INT interrupt.
         */
        uint32_t slc0_token1_1to0_int_clr:1;
        /** slc0_tx_done_int_clr : WT; bitpos: [14]; default: 0;
         *  Set this bit to clear SLC0_TX_DONE_INT_ST interrupt.
         */
        uint32_t slc0_tx_done_int_clr:1;
        /** slc0_tx_suc_eof_int_clr : WT; bitpos: [15]; default: 0;
         *  Set this bit to clear SLC0_TX_SUC_EOF_INT interrupt.
         */
        uint32_t slc0_tx_suc_eof_int_clr:1;
        /** slc0_rx_done_int_clr : WT; bitpos: [16]; default: 0;
         *  Set this bit to clear SLC0_RX_DONE_INT interrupt.
         */
        uint32_t slc0_rx_done_int_clr:1;
        /** slc0_rx_eof_int_clr : WT; bitpos: [17]; default: 0;
         *  Set this bit to clear SLC0_RX_EOF_INT interrupt.
         */
        uint32_t slc0_rx_eof_int_clr:1;
        /** slc0_tohost_int_clr : WT; bitpos: [18]; default: 0;
         *  Set this bit to clear SLC0_TOHOST_INT interrupt.
         */
        uint32_t slc0_tohost_int_clr:1;
        /** slc0_tx_dscr_err_int_clr : WT; bitpos: [19]; default: 0;
         *  Set this bit to clear SLC0_TX_DSCR_ERR_INT interrupt.
         */
        uint32_t slc0_tx_dscr_err_int_clr:1;
        /** slc0_rx_dscr_err_int_clr : WT; bitpos: [20]; default: 0;
         *  Set this bit to clear SLC0_RX_DSCR_ERR_INT interrupt.
         */
        uint32_t slc0_rx_dscr_err_int_clr:1;
        /** slc0_tx_dscr_empty_int_clr : WT; bitpos: [21]; default: 0;
         *  Set this bit to clear SLC0_TX_DSCR_EMPTY_INT interrupt.
         */
        uint32_t slc0_tx_dscr_empty_int_clr:1;
        /** slc0_host_rd_ack_int_clr : WT; bitpos: [22]; default: 0;
         *  Set this bit to clear SLC0_HOST_RD_ACK_INT interrupt.
         */
        uint32_t slc0_host_rd_ack_int_clr:1;
        /** slc0_wr_retry_done_int_clr : WT; bitpos: [23]; default: 0;
         *  Set this bit to clear SLC0_WR_RETRY_DONE_INT interrupt.
         */
        uint32_t slc0_wr_retry_done_int_clr:1;
        /** slc0_tx_err_eof_int_clr : WT; bitpos: [24]; default: 0;
         *  Set this bit to clear SLC0_TX_ERR_EOF_INT interrupt.
         */
        uint32_t slc0_tx_err_eof_int_clr:1;
        /** cmd_dtc_int_clr : WT; bitpos: [25]; default: 0;
         *  Set this bit to clear CMD_DTC_INT interrupt.
         */
        uint32_t cmd_dtc_int_clr:1;
        /** slc0_rx_quick_eof_int_clr : WT; bitpos: [26]; default: 0;
         *  Set this bit to clear SLC0_RX_QUICK_EOF_INT interrupt.
         */
        uint32_t slc0_rx_quick_eof_int_clr:1;
        /** slc0_host_pop_eof_err_int_clr : WT; bitpos: [27]; default: 0;
         *  Set this bit to clear SLC0_HOST_POP_EOF_ERR_INT interrupt.
         */
        uint32_t slc0_host_pop_eof_err_int_clr:1;
        /** hda_recv_done_int_clr : WT; bitpos: [28]; default: 0;
         *  Set this bit to clear HDA_RECV_DONE_INT interrupt.
         */
        uint32_t hda_recv_done_int_clr:1;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} sdio_slc_slc0int_clr_reg_t;

/** Type of slc_slc1int_raw register
 *  Sdio slave DMA channel1 raw interrupt status register.
 */
typedef union {
    struct {
        /** slc_frhost_bit8_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt bit 8 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit8_int_raw:1;
        /** slc_frhost_bit9_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt bit 9 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit9_int_raw:1;
        /** slc_frhost_bit10_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt bit 10 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit10_int_raw:1;
        /** slc_frhost_bit11_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt bit 11 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit11_int_raw:1;
        /** slc_frhost_bit12_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt bit 12 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit12_int_raw:1;
        /** slc_frhost_bit13_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt bit 13 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit13_int_raw:1;
        /** slc_frhost_bit14_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt bit 14 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit14_int_raw:1;
        /** slc_frhost_bit15_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw interrupt bit 15 for host to interrupt slave.
         */
        uint32_t slc_frhost_bit15_int_raw:1;
        /** slc1_rx_start_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw interrupt bit of registering dma channel1 sending initialization
         */
        uint32_t slc1_rx_start_int_raw:1;
        /** slc1_tx_start_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  The raw interrupt bit of registering dma channel1 receiving initialization
         */
        uint32_t slc1_tx_start_int_raw:1;
        /** slc1_rx_udf_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  The raw interrupt bit of dma channel1 sending buffer underflow.
         */
        uint32_t slc1_rx_udf_int_raw:1;
        /** slc1_tx_ovf_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw interrupt bit of dma channel1 receiving buffer overflow.
         */
        uint32_t slc1_tx_ovf_int_raw:1;
        /** slc1_token0_1to0_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The raw interrupt bit for the value of slc0_token0 becoming to zero.
         */
        uint32_t slc1_token0_1to0_int_raw:1;
        /** slc1_token1_1to0_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  The raw interrupt bit for the value of slc0_token1 becoming to zero.
         */
        uint32_t slc1_token1_1to0_int_raw:1;
        /** slc1_tx_done_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  The raw interrupt bit of dma channel1 finishing receiving data to one single buffer.
         */
        uint32_t slc1_tx_done_int_raw:1;
        /** slc1_tx_suc_eof_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  The raw interrupt bit of dma channel1 finishing receiving data
         */
        uint32_t slc1_tx_suc_eof_int_raw:1;
        /** slc1_rx_done_int_raw : R/WTC/SS; bitpos: [16]; default: 0;
         *  The raw interrupt bit of dma channel1 finishing sending data from one single buffer
         */
        uint32_t slc1_rx_done_int_raw:1;
        /** slc1_rx_eof_int_raw : R/WTC/SS; bitpos: [17]; default: 0;
         *  The raw interrupt bit of dma channel1 finishing sending data
         */
        uint32_t slc1_rx_eof_int_raw:1;
        /** slc1_tohost_int_raw : R/WTC/SS; bitpos: [18]; default: 0;
         *  The raw interrupt bit for slave generating interrupt to host.
         */
        uint32_t slc1_tohost_int_raw:1;
        /** slc1_tx_dscr_err_int_raw : R/WTC/SS; bitpos: [19]; default: 0;
         *  The raw interrupt bit of dma channel1 receiving descriptor error.
         */
        uint32_t slc1_tx_dscr_err_int_raw:1;
        /** slc1_rx_dscr_err_int_raw : R/WTC/SS; bitpos: [20]; default: 0;
         *  The raw interrupt bit of dma channel1 sending descriptor error.
         */
        uint32_t slc1_rx_dscr_err_int_raw:1;
        /** slc1_tx_dscr_empty_int_raw : R/WTC/SS; bitpos: [21]; default: 0;
         *  The raw interrupt bit of  not enough buffer for slave receiving data from host
         *  through dma channel1.
         */
        uint32_t slc1_tx_dscr_empty_int_raw:1;
        /** slc1_host_rd_ack_int_raw : R/WTC/SS; bitpos: [22]; default: 0;
         *  The raw interrupt bit for host to acknowledge retrying receiving data from slave
         *  successfully through dma channel1.
         */
        uint32_t slc1_host_rd_ack_int_raw:1;
        /** slc1_wr_retry_done_int_raw : R/WTC/SS; bitpos: [23]; default: 0;
         *  The raw interrupt bit of host finishing retrying sending data to slave through dma
         *  channel1.
         */
        uint32_t slc1_wr_retry_done_int_raw:1;
        /** slc1_tx_err_eof_int_raw : R/WTC/SS; bitpos: [24]; default: 0;
         *  The raw interrupt bit of data error during host sending data to slave through dma
         *  channel1.
         */
        uint32_t slc1_tx_err_eof_int_raw:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} sdio_slc_slc1int_raw_reg_t;

/** Type of slc_slc1int_st register
 *  Sdio slave DMA channel1 masked interrupt status register.
 */
typedef union {
    struct {
        /** slc_frhost_bit8_int_st : RO; bitpos: [0]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT0_INT interrupt.
         */
        uint32_t slc_frhost_bit8_int_st:1;
        /** slc_frhost_bit9_int_st : RO; bitpos: [1]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT1_INT interrupt.
         */
        uint32_t slc_frhost_bit9_int_st:1;
        /** slc_frhost_bit10_int_st : RO; bitpos: [2]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT2_INT interrupt.
         */
        uint32_t slc_frhost_bit10_int_st:1;
        /** slc_frhost_bit11_int_st : RO; bitpos: [3]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT3_INT interrupt.
         */
        uint32_t slc_frhost_bit11_int_st:1;
        /** slc_frhost_bit12_int_st : RO; bitpos: [4]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT4_INT interrupt.
         */
        uint32_t slc_frhost_bit12_int_st:1;
        /** slc_frhost_bit13_int_st : RO; bitpos: [5]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT5_INT interrupt.
         */
        uint32_t slc_frhost_bit13_int_st:1;
        /** slc_frhost_bit14_int_st : RO; bitpos: [6]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT6_INT interrupt.
         */
        uint32_t slc_frhost_bit14_int_st:1;
        /** slc_frhost_bit15_int_st : RO; bitpos: [7]; default: 0;
         *  The masked interrupt status bit for SLC_FRHOST_BIT7_INT interrupt.
         */
        uint32_t slc_frhost_bit15_int_st:1;
        /** slc1_rx_start_int_st : RO; bitpos: [8]; default: 0;
         *  The masked interrupt status bit for SLC1_RX_START_INT_ST interrupt.
         */
        uint32_t slc1_rx_start_int_st:1;
        /** slc1_tx_start_int_st : RO; bitpos: [9]; default: 0;
         *  The masked interrupt status bit for SLC1_TX_START_INT_ST interrupt.
         */
        uint32_t slc1_tx_start_int_st:1;
        /** slc1_rx_udf_int_st : RO; bitpos: [10]; default: 0;
         *  The masked interrupt status bit for SLC1_RX_UDF_INT interrupt.
         */
        uint32_t slc1_rx_udf_int_st:1;
        /** slc1_tx_ovf_int_st : RO; bitpos: [11]; default: 0;
         *  The masked interrupt status bit for SLC1_TX_OVF_INT interrupt.
         */
        uint32_t slc1_tx_ovf_int_st:1;
        /** slc1_token0_1to0_int_st : RO; bitpos: [12]; default: 0;
         *  The masked interrupt status bit for SLC1_TOKEN0_1TO0_INT interrupt.
         */
        uint32_t slc1_token0_1to0_int_st:1;
        /** slc1_token1_1to0_int_st : RO; bitpos: [13]; default: 0;
         *  The masked interrupt status bit for SLC1_TOKEN1_1TO0_INT interrupt.
         */
        uint32_t slc1_token1_1to0_int_st:1;
        /** slc1_tx_done_int_st : RO; bitpos: [14]; default: 0;
         *  The masked interrupt status bit for SLC1_TX_DONE_INT_ST interrupt.
         */
        uint32_t slc1_tx_done_int_st:1;
        /** slc1_tx_suc_eof_int_st : RO; bitpos: [15]; default: 0;
         *  The masked interrupt status bit for SLC1_TX_SUC_EOF_INT interrupt.
         */
        uint32_t slc1_tx_suc_eof_int_st:1;
        /** slc1_rx_done_int_st : RO; bitpos: [16]; default: 0;
         *  The masked interrupt status bit for SLC1_RX_DONE_INT interrupt.
         */
        uint32_t slc1_rx_done_int_st:1;
        /** slc1_rx_eof_int_st : RO; bitpos: [17]; default: 0;
         *  The masked interrupt status bit for SLC1_RX_EOF_INT interrupt.
         */
        uint32_t slc1_rx_eof_int_st:1;
        /** slc1_tohost_int_st : RO; bitpos: [18]; default: 0;
         *  The masked interrupt status bit for SLC1_TOHOST_INT interrupt.
         */
        uint32_t slc1_tohost_int_st:1;
        /** slc1_tx_dscr_err_int_st : RO; bitpos: [19]; default: 0;
         *  The masked interrupt status bit for SLC1_TX_DSCR_ERR_INT interrupt.
         */
        uint32_t slc1_tx_dscr_err_int_st:1;
        /** slc1_rx_dscr_err_int_st : RO; bitpos: [20]; default: 0;
         *  The masked interrupt status bit for SLC1_RX_DSCR_ERR_INT interrupt.
         */
        uint32_t slc1_rx_dscr_err_int_st:1;
        /** slc1_tx_dscr_empty_int_st : RO; bitpos: [21]; default: 0;
         *  The masked interrupt status bit for SLC1_TX_DSCR_EMPTY_INT interrupt.
         */
        uint32_t slc1_tx_dscr_empty_int_st:1;
        /** slc1_host_rd_ack_int_st : RO; bitpos: [22]; default: 0;
         *  The masked interrupt status bit for SLC1_HOST_RD_ACK_INT interrupt.
         */
        uint32_t slc1_host_rd_ack_int_st:1;
        /** slc1_wr_retry_done_int_st : RO; bitpos: [23]; default: 0;
         *  The masked interrupt status bit for SLC1_WR_RETRY_DONE_INT interrupt.
         */
        uint32_t slc1_wr_retry_done_int_st:1;
        /** slc1_tx_err_eof_int_st : RO; bitpos: [24]; default: 0;
         *  The masked interrupt status bit for SLC1_TX_ERR_EOF_INT interrupt.
         */
        uint32_t slc1_tx_err_eof_int_st:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} sdio_slc_slc1int_st_reg_t;

