espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_struct.h
/** Type of slc_slc1int_ena1 register
 *  Sdio slave DMA channel1 interrupt enable register1.
 */
typedef union {
    struct {
        /** slc_frhost_bit8_int_ena1 : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit1 for SLC_FRHOST_bit10_INT interrupt.
         */
        uint32_t slc_frhost_bit8_int_ena1:1;
        /** slc_frhost_bit9_int_ena1 : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit1 for SLC_FRHOST_bit11_INT interrupt.
         */
        uint32_t slc_frhost_bit9_int_ena1:1;
        /** slc_frhost_bit10_int_ena1 : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit1 for SLC_FRHOST_bit12_INT interrupt.
         */
        uint32_t slc_frhost_bit10_int_ena1:1;
        /** slc_frhost_bit11_int_ena1 : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit1 for SLC_FRHOST_bit13_INT interrupt.
         */
        uint32_t slc_frhost_bit11_int_ena1:1;
        /** slc_frhost_bit12_int_ena1 : R/W; bitpos: [4]; default: 0;
         *  The interrupt enable bit1 for SLC_FRHOST_bit14_INT interrupt.
         */
        uint32_t slc_frhost_bit12_int_ena1:1;
        /** slc_frhost_bit13_int_ena1 : R/W; bitpos: [5]; default: 0;
         *  The interrupt enable bit1 for SLC_FRHOST_bit15_INT interrupt.
         */
        uint32_t slc_frhost_bit13_int_ena1:1;
        /** slc_frhost_bit14_int_ena1 : R/W; bitpos: [6]; default: 0;
         *  The interrupt enable bit1 for SLC_FRHOST_bit16_INT interrupt.
         */
        uint32_t slc_frhost_bit14_int_ena1:1;
        /** slc_frhost_bit15_int_ena1 : R/W; bitpos: [7]; default: 0;
         *  The interrupt enable bit1 for SLC_FRHOST_bit17_INT interrupt.
         */
        uint32_t slc_frhost_bit15_int_ena1:1;
        /** slc1_rx_start_int_ena1 : R/W; bitpos: [8]; default: 0;
         *  The interrupt enable bit1 for SCL1_RX_START_INT_ST interrupt.
         */
        uint32_t slc1_rx_start_int_ena1:1;
        /** slc1_tx_start_int_ena1 : R/W; bitpos: [9]; default: 0;
         *  The interrupt enable bit1 for SCL1_TX_START_INT_ST interrupt.
         */
        uint32_t slc1_tx_start_int_ena1:1;
        /** slc1_rx_udf_int_ena1 : R/W; bitpos: [10]; default: 0;
         *  The interrupt enable bit1 for SCL1_RX_UDF_INT interrupt.
         */
        uint32_t slc1_rx_udf_int_ena1:1;
        /** slc1_tx_ovf_int_ena1 : R/W; bitpos: [11]; default: 0;
         *  The interrupt enable bit1 for SCL1_TX_OVF_INT interrupt.
         */
        uint32_t slc1_tx_ovf_int_ena1:1;
        /** slc1_token0_1to0_int_ena1 : R/W; bitpos: [12]; default: 0;
         *  The interrupt enable bit1 for SCL1_TOKEN0_1TO0_INT interrupt.
         */
        uint32_t slc1_token0_1to0_int_ena1:1;
        /** slc1_token1_1to0_int_ena1 : R/W; bitpos: [13]; default: 0;
         *  The interrupt enable bit1 for SCL1_TOKEN1_1TO0_INT interrupt.
         */
        uint32_t slc1_token1_1to0_int_ena1:1;
        /** slc1_tx_done_int_ena1 : R/W; bitpos: [14]; default: 0;
         *  The interrupt enable bit1 for SCL1_TX_DONE_INT_ST interrupt.
         */
        uint32_t slc1_tx_done_int_ena1:1;
        /** slc1_tx_suc_eof_int_ena1 : R/W; bitpos: [15]; default: 0;
         *  The interrupt enable bit1 for SCL1_TX_SUC_EOF_INT interrupt.
         */
        uint32_t slc1_tx_suc_eof_int_ena1:1;
        /** slc1_rx_done_int_ena1 : R/W; bitpos: [16]; default: 0;
         *  The interrupt enable bit1 for SCL1_RX_DONE_INT interrupt.
         */
        uint32_t slc1_rx_done_int_ena1:1;
        /** slc1_rx_eof_int_ena1 : R/W; bitpos: [17]; default: 0;
         *  The interrupt enable bit1 for SCL1_RX_EOF_INT interrupt.
         */
        uint32_t slc1_rx_eof_int_ena1:1;
        /** slc1_tohost_int_ena1 : R/W; bitpos: [18]; default: 0;
         *  The interrupt enable bit1 for SCL1_TOHOST_INT interrupt.
         */
        uint32_t slc1_tohost_int_ena1:1;
        /** slc1_tx_dscr_err_int_ena1 : R/W; bitpos: [19]; default: 0;
         *  The interrupt enable bit1 for SCL1_TX_DSCR_ERR_INT interrupt.
         */
        uint32_t slc1_tx_dscr_err_int_ena1:1;
        /** slc1_rx_dscr_err_int_ena1 : R/W; bitpos: [20]; default: 0;
         *  The interrupt enable bit1 for SCL1_RX_DSCR_ERR_INT interrupt.
         */
        uint32_t slc1_rx_dscr_err_int_ena1:1;
        /** slc1_tx_dscr_empty_int_ena1 : R/W; bitpos: [21]; default: 0;
         *  The interrupt enable bit1 for SCL1_TX_DSCR_EMPTY_INT interrupt.
         */
        uint32_t slc1_tx_dscr_empty_int_ena1:1;
        /** slc1_host_rd_ack_int_ena1 : R/W; bitpos: [22]; default: 0;
         *  The interrupt enable bit1 for SCL1_HOST_RD_ACK_INT interrupt.
         */
        uint32_t slc1_host_rd_ack_int_ena1:1;
        /** slc1_wr_retry_done_int_ena1 : R/W; bitpos: [23]; default: 0;
         *  The interrupt enable bit1 for SCL1_WR_RETRY_DONE_INT interrupt.
         */
        uint32_t slc1_wr_retry_done_int_ena1:1;
        /** slc1_tx_err_eof_int_ena1 : R/W; bitpos: [24]; default: 0;
         *  The interrupt enable bit1 for SCL1_TX_ERR_EOF_INT interrupt.
         */
        uint32_t slc1_tx_err_eof_int_ena1:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} sdio_slc_slc1int_ena1_reg_t;


/** Group: Status registers */
/** Type of slc_rx_status register
 *  Sdio slave DMA rxfifo status register.
 */
typedef union {
    struct {
        /** slc0_rx_full : RO; bitpos: [0]; default: 0;
         *  The status bit for rxfifo full during slave sending data to host through dma
         *  channel0.
         */
        uint32_t slc0_rx_full:1;
        /** slc0_rx_empty : RO; bitpos: [1]; default: 1;
         *  The status bit for rxfifo empty during slave sending data to host through dma
         *  channel0.
         */
        uint32_t slc0_rx_empty:1;
        /** slc0_rx_buf_len : RO; bitpos: [15:2]; default: 0;
         *  the current buffer length during slave sending data to host through dma channel0.
         */
        uint32_t slc0_rx_buf_len:14;
        /** slc1_rx_full : RO; bitpos: [16]; default: 0;
         *  The status bit for rxfifo full during slave sending data to host through dma
         *  channel1.
         */
        uint32_t slc1_rx_full:1;
        /** slc1_rx_empty : RO; bitpos: [17]; default: 1;
         *  The status bit for rxfifo empty during slave sending data to host through dma
         *  channel1.
         */
        uint32_t slc1_rx_empty:1;
        /** slc1_rx_buf_len : RO; bitpos: [31:18]; default: 0;
         *  the current buffer length during slave sending data to host through dma channel1.
         */
        uint32_t slc1_rx_buf_len:14;
    };
    uint32_t val;
} sdio_slc_rx_status_reg_t;

