espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_struct.h
/** Type of slc_tx_status register
 *  Sdio slave DMA txfifo status register.
 */
typedef union {
    struct {
        /** slc0_tx_full : RO; bitpos: [0]; default: 0;
         *  The status bit for txfifo full during slave receiving data from host through dma
         *  channel0.
         */
        uint32_t slc0_tx_full:1;
        /** slc0_tx_empty : RO; bitpos: [1]; default: 1;
         *  The status bit for txfifo empty during slave receiving data from host through dma
         *  channel0.
         */
        uint32_t slc0_tx_empty:1;
        uint32_t reserved_2:14;
        /** slc1_tx_full : RO; bitpos: [16]; default: 0;
         *  The status bit for txfifo full during slave receiving data from host through dma
         *  channel1.
         */
        uint32_t slc1_tx_full:1;
        /** slc1_tx_empty : RO; bitpos: [17]; default: 1;
         *  The status bit for txfifo empty during slave receiving data from host through dma
         *  channel1.
         */
        uint32_t slc1_tx_empty:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} sdio_slc_tx_status_reg_t;

/** Type of slc_slc0_state0 register
 *  Sdio slave DMA channel0 status register.
 */
typedef union {
    struct {
        /** slc0_state0 : RO; bitpos: [31:0]; default: 0;
         *  [18:0] the current receiving descriptor address, [20:19] receiving descriptor fsm
         *  state, [23:21] receiving fsm state, [30:24] the count value of data received in
         *  txfifo
         */
        uint32_t slc0_state0:32;
    };
    uint32_t val;
} sdio_slc_slc0_state0_reg_t;

/** Type of slc_slc0_state1 register
 *  Sdio slave DMA channel0 status1 register.
 */
typedef union {
    struct {
        /** slc0_state1 : RO; bitpos: [31:0]; default: 0;
         *  [18:0] the current sending descriptor address, [20:19] sending descriptor fsm
         *  state, [23:21] sending fsm state, [30:24] the count value of data to be sent in
         *  rxfifo
         */
        uint32_t slc0_state1:32;
    };
    uint32_t val;
} sdio_slc_slc0_state1_reg_t;

/** Type of slc_slc1_state0 register
 *  Sdio slave DMA channel1 status register.
 */
typedef union {
    struct {
        /** slc1_state0 : RO; bitpos: [31:0]; default: 0;
         *  [18:0] the current receiving descriptor address, [20:19] receiving descriptor fsm
         *  state, [23:21] receiving fsm state, [30:24] the count value of data received in
         *  txfifo
         */
        uint32_t slc1_state0:32;
    };
    uint32_t val;
} sdio_slc_slc1_state0_reg_t;

/** Type of slc_slc1_state1 register
 *  Sdio slave DMA channel1 status1 register.
 */
typedef union {
    struct {
        /** slc1_state1 : RO; bitpos: [31:0]; default: 0;
         *  [18:0] the current sending descriptor address, [20:19] sending descriptor fsm
         *  state, [23:21] sending fsm state, [30:24] the count value of data to be sent in
         *  rxfifo
         */
        uint32_t slc1_state1:32;
    };
    uint32_t val;
} sdio_slc_slc1_state1_reg_t;

/** Type of slc_sdio_st register
 *  Sdio slave function status register.
 */
typedef union {
    struct {
        /** cmd_st : RO; bitpos: [2:0]; default: 0;
         *  The sdio command fsm state.
         */
        uint32_t cmd_st:3;
        uint32_t reserved_3:1;
        /** func_st : RO; bitpos: [7:4]; default: 0;
         *  The sdio cmd52/53 function fsm state.
         */
        uint32_t func_st:4;
        /** sdio_wakeup : RO; bitpos: [8]; default: 0;
         *  reserved
         */
        uint32_t sdio_wakeup:1;
        uint32_t reserved_9:3;
        /** bus_st : RO; bitpos: [14:12]; default: 0;
         *  The sdio bus fsm state.
         */
        uint32_t bus_st:3;
        uint32_t reserved_15:1;
        /** func1_acc_state : RO; bitpos: [20:16]; default: 0;
         *  The sdio func1 fsm state.
         */
        uint32_t func1_acc_state:5;
        uint32_t reserved_21:3;
        /** func2_acc_state : RO; bitpos: [28:24]; default: 0;
         *  The sdio func2 fsm state.
         */
        uint32_t func2_acc_state:5;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} sdio_slc_sdio_st_reg_t;

/** Type of slc_slc0_txlink_dscr register
 *  ******* Description ***********
 */
typedef union {
    struct {
        /** slc0_txlink_dscr : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t slc0_txlink_dscr:32;
    };
    uint32_t val;
} sdio_slc_slc0_txlink_dscr_reg_t;

/** Type of slc_slc0_txlink_dscr_bf0 register
 *  ******* Description ***********
 */
typedef union {
    struct {
        /** slc0_txlink_dscr_bf0 : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t slc0_txlink_dscr_bf0:32;
    };
    uint32_t val;
} sdio_slc_slc0_txlink_dscr_bf0_reg_t;

/** Type of slc_slc0_txlink_dscr_bf1 register
 *  reserved
 */
typedef union {
    struct {
        /** slc0_txlink_dscr_bf1 : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t slc0_txlink_dscr_bf1:32;
    };
    uint32_t val;
} sdio_slc_slc0_txlink_dscr_bf1_reg_t;

/** Type of slc_slc0_rxlink_dscr register
 *  ******* Description ***********
 */
typedef union {
    struct {
        /** slc0_rxlink_dscr : RO; bitpos: [31:0]; default: 0;
         *  the third word of slc0 link descriptor, or known as the next descriptor address
         */
        uint32_t slc0_rxlink_dscr:32;
    };
    uint32_t val;
} sdio_slc_slc0_rxlink_dscr_reg_t;

/** Type of slc_slc0_rxlink_dscr_bf0 register
 *  ******* Description ***********
 */
typedef union {
    struct {
        /** slc0_rxlink_dscr_bf0 : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t slc0_rxlink_dscr_bf0:32;
    };
    uint32_t val;
} sdio_slc_slc0_rxlink_dscr_bf0_reg_t;

/** Type of slc_slc0_rxlink_dscr_bf1 register
 *  reserved
 */
typedef union {
    struct {
        /** slc0_rxlink_dscr_bf1 : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t slc0_rxlink_dscr_bf1:32;
    };
    uint32_t val;
} sdio_slc_slc0_rxlink_dscr_bf1_reg_t;

