espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_struct.h
/** Type of slc_slc1_txlink_dscr register
 *  reserved
 */
typedef union {
    struct {
        /** slc1_txlink_dscr : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t slc1_txlink_dscr:32;
    };
    uint32_t val;
} sdio_slc_slc1_txlink_dscr_reg_t;

/** Type of slc_slc1_txlink_dscr_bf0 register
 *  reserved
 */
typedef union {
    struct {
        /** slc1_txlink_dscr_bf0 : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t slc1_txlink_dscr_bf0:32;
    };
    uint32_t val;
} sdio_slc_slc1_txlink_dscr_bf0_reg_t;

/** Type of slc_slc1_txlink_dscr_bf1 register
 *  reserved
 */
typedef union {
    struct {
        /** slc1_txlink_dscr_bf1 : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t slc1_txlink_dscr_bf1:32;
    };
    uint32_t val;
} sdio_slc_slc1_txlink_dscr_bf1_reg_t;

/** Type of slc_slc1_rxlink_dscr register
 *  ******* Description ***********
 */
typedef union {
    struct {
        /** slc1_rxlink_dscr : RO; bitpos: [31:0]; default: 0;
         *  the third word of slc1 link descriptor, or known as the next descriptor address
         */
        uint32_t slc1_rxlink_dscr:32;
    };
    uint32_t val;
} sdio_slc_slc1_rxlink_dscr_reg_t;

/** Type of slc_slc1_rxlink_dscr_bf0 register
 *  ******* Description ***********
 */
typedef union {
    struct {
        /** slc1_rxlink_dscr_bf0 : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t slc1_rxlink_dscr_bf0:32;
    };
    uint32_t val;
} sdio_slc_slc1_rxlink_dscr_bf0_reg_t;

/** Type of slc_slc1_rxlink_dscr_bf1 register
 *  reserved
 */
typedef union {
    struct {
        /** slc1_rxlink_dscr_bf1 : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t slc1_rxlink_dscr_bf1:32;
    };
    uint32_t val;
} sdio_slc_slc1_rxlink_dscr_bf1_reg_t;

/** Type of slc_slc0_tx_erreof_des_addr register
 *  reserved
 */
typedef union {
    struct {
        /** slc0_tx_err_eof_des_addr : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t slc0_tx_err_eof_des_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_tx_erreof_des_addr_reg_t;

/** Type of slc_slc1_tx_erreof_des_addr register
 *  reserved
 */
typedef union {
    struct {
        /** slc1_tx_err_eof_des_addr : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t slc1_tx_err_eof_des_addr:32;
    };
    uint32_t val;
} sdio_slc_slc1_tx_erreof_des_addr_reg_t;

/** Type of slc_token_lat register
 *  reserved
 */
typedef union {
    struct {
        /** slc0_token : RO; bitpos: [11:0]; default: 0;
         *  reserved
         */
        uint32_t slc0_token:12;
        uint32_t reserved_12:4;
        /** slc1_token : RO; bitpos: [27:16]; default: 0;
         *  reserved
         */
        uint32_t slc1_token:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} sdio_slc_token_lat_reg_t;

/** Type of slc_cmd_infor0 register
 *  reserved
 */
typedef union {
    struct {
        /** cmd_content0 : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t cmd_content0:32;
    };
    uint32_t val;
} sdio_slc_cmd_infor0_reg_t;

/** Type of slc_cmd_infor1 register
 *  reserved
 */
typedef union {
    struct {
        /** cmd_content1 : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t cmd_content1:32;
    };
    uint32_t val;
} sdio_slc_cmd_infor1_reg_t;

/** Type of slc_slc0_length register
 *  reserved
 */
typedef union {
    struct {
        /** slc0_len : RO; bitpos: [19:0]; default: 0;
         *  Indicates the paclet length sent by the slave through dma channel0.
         */
        uint32_t slc0_len:20;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sdio_slc_slc0_length_reg_t;

/** Type of slc_sdio_crc_st0 register
 *  Sdio slave receiving packet data crc status register.
 */
typedef union {
    struct {
        /** dat0_crc_err_cnt : RO; bitpos: [7:0]; default: 0;
         *  The count value of received packet data crc errors on sd_data0 line.
         */
        uint32_t dat0_crc_err_cnt:8;
        /** dat1_crc_err_cnt : RO; bitpos: [15:8]; default: 0;
         *  The count value of received packet data crc errors on sd_data1 line.
         */
        uint32_t dat1_crc_err_cnt:8;
        /** dat2_crc_err_cnt : RO; bitpos: [23:16]; default: 0;
         *  The count value of received packet data crc errors on sd_data2 line.
         */
        uint32_t dat2_crc_err_cnt:8;
        /** dat3_crc_err_cnt : RO; bitpos: [31:24]; default: 0;
         *  The count value of received packet data crc errors on sd_data3 line.
         */
        uint32_t dat3_crc_err_cnt:8;
    };
    uint32_t val;
} sdio_slc_sdio_crc_st0_reg_t;

/** Type of slc_slc0_eof_start_des register
 *  Sdio slave DMA channel0 start address of sending linked list status register.
 */
typedef union {
    struct {
        /** slc0_eof_start_des_addr : RO; bitpos: [31:0]; default: 0;
         *  The start address of the linked list of the last sent packet through dma channel0.
         */
        uint32_t slc0_eof_start_des_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_eof_start_des_reg_t;

/** Type of slc_slc0_push_dscr_addr register
 *  Sdio slave DMA channel0 address of sending linked list status register.
 */
typedef union {
    struct {
        /** slc0_rx_push_dscr_addr : RO; bitpos: [31:0]; default: 0;
         *  the current descriptor address when slc0 gets a link descriptor, aligned with word
         */
        uint32_t slc0_rx_push_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_push_dscr_addr_reg_t;

/** Type of slc_slc0_done_dscr_addr register
 *  Sdio slave DMA channel0 address of sending linked list status register1.
 */
typedef union {
    struct {
        /** slc0_rx_done_dscr_addr : RO; bitpos: [31:0]; default: 0;
         *  the current descriptor address when slc0 finishes reading data from one buffer,
         *  aligned with word
         */
        uint32_t slc0_rx_done_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_done_dscr_addr_reg_t;

/** Type of slc_slc0_sub_start_des register
 *  Sdio slave DMA channel0 start address of sending linked list status register.
 */
typedef union {
    struct {
        /** slc0_sub_pac_start_dscr_addr : RO; bitpos: [31:0]; default: 0;
         *  The start address of the linked list of the last sent packet through dma channel0.
         */
        uint32_t slc0_sub_pac_start_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc_slc0_sub_start_des_reg_t;

/** Type of slc_slc0_dscr_cnt register
 *  Sdio slave DMA channel0 descriptor status register.
 */
typedef union {
    struct {
        /** slc0_rx_dscr_cnt_lat : RO; bitpos: [9:0]; default: 0;
         *  The number of descriptors got by dma channel0 for sending packets.
         */
        uint32_t slc0_rx_dscr_cnt_lat:10;
        uint32_t reserved_10:6;
        /** slc0_rx_get_eof_occ : RO; bitpos: [16]; default: 0;
         *  The status of last packet finishing sending to host.
         */
        uint32_t slc0_rx_get_eof_occ:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} sdio_slc_slc0_dscr_cnt_reg_t;


/** Group: Debud registers */
/** Type of slc_slc0txfifo_pop register
 *  Sdio slave DMA channel0 txfifo debug register.
 */
typedef union {
    struct {
        /** slc0_txfifo_rdata : RO; bitpos: [10:0]; default: 1024;
         *  This field saves the data read from txfifo through APB bus.
         */
        uint32_t slc0_txfifo_rdata:11;
        uint32_t reserved_11:5;
        /** slc0_txfifo_pop : R/W/SC; bitpos: [16]; default: 0;
         *  Set this bit to read data from txfifo through APB bus. This bit is cleared
         *  automatically after reading one data from slc0_txfifo through APB bus successfully.
         */
        uint32_t slc0_txfifo_pop:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} sdio_slc_slc0txfifo_pop_reg_t;

/** Type of slc_slc1txfifo_pop register
 *  Sdio slave DMA channel1 txfifo debug register.
 */
typedef union {
    struct {
        /** slc1_txfifo_rdata : RO; bitpos: [10:0]; default: 1024;
         *  This field saves the data read from txfifo through APB bus.
         */
        uint32_t slc1_txfifo_rdata:11;
        uint32_t reserved_11:5;
        /** slc1_txfifo_pop : R/W/SC; bitpos: [16]; default: 0;
         *  Set this bit to read data from txfifo through APB bus. This bit is cleared
         *  automatically after reading one data from slc1_txfifo through APB bus successfully.
         */
        uint32_t slc1_txfifo_pop:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} sdio_slc_slc1txfifo_pop_reg_t;

/** Type of slc_ahb_test register
 *  Sdio slave AHB test register.
 */
typedef union {
    struct {
        /** slc_ahb_testmode : R/W; bitpos: [2:0]; default: 0;
         *  set bit2 to 1 to enable sdio slave ahb test.
         */
        uint32_t slc_ahb_testmode:3;
        uint32_t reserved_3:1;
        /** slc_ahb_testaddr : R/W; bitpos: [5:4]; default: 0;
         *  Configure AHB test address.
         */
        uint32_t slc_ahb_testaddr:2;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} sdio_slc_ahb_test_reg_t;


