espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_struct.h
/** Group: Version registers */
/** Type of slc_date register
 *  Sdio slave DMA version register.
 */
typedef union {
    struct {
        /** slc_date : R/W; bitpos: [31:0]; default: 554182400;
         *  Sdio slave DMA version register.
         */
        uint32_t slc_date:32;
    };
    uint32_t val;
} sdio_slc_date_reg_t;

/** Type of slc_id register
 *  Sdio slave ID register.
 */
typedef union {
    struct {
        /** slc_id : R/W; bitpos: [31:0]; default: 256;
         *  reserved
         */
        uint32_t slc_id:32;
    };
    uint32_t val;
} sdio_slc_id_reg_t;


typedef struct {
    volatile sdio_slc_conf0_reg_t slc_conf0;
    volatile sdio_slc_slc0int_raw_reg_t slc_slc0int_raw;
    volatile sdio_slc_slc0int_st_reg_t slc_slc0int_st;
    volatile sdio_slc_slc0int_ena_reg_t slc_slc0int_ena;
    volatile sdio_slc_slc0int_clr_reg_t slc_slc0int_clr;
    volatile sdio_slc_slc1int_raw_reg_t slc_slc1int_raw;
    volatile sdio_slc_slc1int_st_reg_t slc_slc1int_st;
    volatile sdio_slc_slc1int_ena_reg_t slc_slc1int_ena;
    volatile sdio_slc_slc1int_clr_reg_t slc_slc1int_clr;
    volatile sdio_slc_rx_status_reg_t slc_rx_status;
    volatile sdio_slc_slc0rxfifo_push_reg_t slc_slc0rxfifo_push;
    volatile sdio_slc_slc1rxfifo_push_reg_t slc_slc1rxfifo_push;
    volatile sdio_slc_tx_status_reg_t slc_tx_status;
    volatile sdio_slc_slc0txfifo_pop_reg_t slc_slc0txfifo_pop;
    volatile sdio_slc_slc1txfifo_pop_reg_t slc_slc1txfifo_pop;
    volatile sdio_slc_slc0rx_link_reg_t slc_slc0rx_link;
    volatile sdio_slc_slc0rx_link_addr_reg_t slc_slc0rx_link_addr;
    volatile sdio_slc_slc0tx_link_reg_t slc_slc0tx_link;
    volatile sdio_slc_slc0tx_link_addr_reg_t slc_slc0tx_link_addr;
    volatile sdio_slc_slc1rx_link_reg_t slc_slc1rx_link;
    volatile sdio_slc_slc1rx_link_addr_reg_t slc_slc1rx_link_addr;
    volatile sdio_slc_slc1tx_link_reg_t slc_slc1tx_link;
    volatile sdio_slc_slc1tx_link_addr_reg_t slc_slc1tx_link_addr;
    volatile sdio_slc_slcintvec_tohost_reg_t slc_slcintvec_tohost;
    volatile sdio_slc_slc0token0_reg_t slc_slc0token0;
    volatile sdio_slc_slc0token1_reg_t slc_slc0token1;
    volatile sdio_slc_slc1token0_reg_t slc_slc1token0;
    volatile sdio_slc_slc1token1_reg_t slc_slc1token1;
    volatile sdio_slc_conf1_reg_t slc_conf1;
    volatile sdio_slc_slc0_state0_reg_t slc_slc0_state0;
    volatile sdio_slc_slc0_state1_reg_t slc_slc0_state1;
    volatile sdio_slc_slc1_state0_reg_t slc_slc1_state0;
    volatile sdio_slc_slc1_state1_reg_t slc_slc1_state1;
    volatile sdio_slc_bridge_conf_reg_t slc_bridge_conf;
    volatile sdio_slc_slc0_to_eof_des_addr_reg_t slc_slc0_to_eof_des_addr;
    volatile sdio_slc_slc0_tx_eof_des_addr_reg_t slc_slc0_tx_eof_des_addr;
    volatile sdio_slc_slc0_to_eof_bfr_des_addr_reg_t slc_slc0_to_eof_bfr_des_addr;
    volatile sdio_slc_slc1_to_eof_des_addr_reg_t slc_slc1_to_eof_des_addr;
    volatile sdio_slc_slc1_tx_eof_des_addr_reg_t slc_slc1_tx_eof_des_addr;
    volatile sdio_slc_slc1_to_eof_bfr_des_addr_reg_t slc_slc1_to_eof_bfr_des_addr;
    volatile sdio_slc_ahb_test_reg_t slc_ahb_test;
    volatile sdio_slc_sdio_st_reg_t slc_sdio_st;
    volatile sdio_slc_rx_dscr_conf_reg_t slc_rx_dscr_conf;
    volatile sdio_slc_slc0_txlink_dscr_reg_t slc_slc0_txlink_dscr;
    volatile sdio_slc_slc0_txlink_dscr_bf0_reg_t slc_slc0_txlink_dscr_bf0;
    volatile sdio_slc_slc0_txlink_dscr_bf1_reg_t slc_slc0_txlink_dscr_bf1;
    volatile sdio_slc_slc0_rxlink_dscr_reg_t slc_slc0_rxlink_dscr;
    volatile sdio_slc_slc0_rxlink_dscr_bf0_reg_t slc_slc0_rxlink_dscr_bf0;
    volatile sdio_slc_slc0_rxlink_dscr_bf1_reg_t slc_slc0_rxlink_dscr_bf1;
    volatile sdio_slc_slc1_txlink_dscr_reg_t slc_slc1_txlink_dscr;
    volatile sdio_slc_slc1_txlink_dscr_bf0_reg_t slc_slc1_txlink_dscr_bf0;
    volatile sdio_slc_slc1_txlink_dscr_bf1_reg_t slc_slc1_txlink_dscr_bf1;
    volatile sdio_slc_slc1_rxlink_dscr_reg_t slc_slc1_rxlink_dscr;
    volatile sdio_slc_slc1_rxlink_dscr_bf0_reg_t slc_slc1_rxlink_dscr_bf0;
    volatile sdio_slc_slc1_rxlink_dscr_bf1_reg_t slc_slc1_rxlink_dscr_bf1;
    volatile sdio_slc_slc0_tx_erreof_des_addr_reg_t slc_slc0_tx_erreof_des_addr;
    volatile sdio_slc_slc1_tx_erreof_des_addr_reg_t slc_slc1_tx_erreof_des_addr;
    volatile sdio_slc_token_lat_reg_t slc_token_lat;
    volatile sdio_slc_tx_dscr_conf_reg_t slc_tx_dscr_conf;
    volatile sdio_slc_cmd_infor0_reg_t slc_cmd_infor0;
    volatile sdio_slc_cmd_infor1_reg_t slc_cmd_infor1;
    volatile sdio_slc_slc0_len_conf_reg_t slc_slc0_len_conf;
    volatile sdio_slc_slc0_length_reg_t slc_slc0_length;
    volatile sdio_slc_slc0_txpkt_h_dscr_reg_t slc_slc0_txpkt_h_dscr;
    volatile sdio_slc_slc0_txpkt_e_dscr_reg_t slc_slc0_txpkt_e_dscr;
    volatile sdio_slc_slc0_rxpkt_h_dscr_reg_t slc_slc0_rxpkt_h_dscr;
    volatile sdio_slc_slc0_rxpkt_e_dscr_reg_t slc_slc0_rxpkt_e_dscr;
    volatile sdio_slc_slc0_txpktu_h_dscr_reg_t slc_slc0_txpktu_h_dscr;
    volatile sdio_slc_slc0_txpktu_e_dscr_reg_t slc_slc0_txpktu_e_dscr;
    volatile sdio_slc_slc0_rxpktu_h_dscr_reg_t slc_slc0_rxpktu_h_dscr;
    volatile sdio_slc_slc0_rxpktu_e_dscr_reg_t slc_slc0_rxpktu_e_dscr;
    volatile sdio_slc_seq_position_reg_t slc_seq_position;
    volatile sdio_slc_slc0_dscr_rec_conf_reg_t slc_slc0_dscr_rec_conf;
    volatile sdio_slc_sdio_crc_st0_reg_t slc_sdio_crc_st0;
    volatile sdio_slc_sdio_crc_st1_reg_t slc_sdio_crc_st1;
    volatile sdio_slc_slc0_eof_start_des_reg_t slc_slc0_eof_start_des;
    volatile sdio_slc_slc0_push_dscr_addr_reg_t slc_slc0_push_dscr_addr;
    volatile sdio_slc_slc0_done_dscr_addr_reg_t slc_slc0_done_dscr_addr;
    volatile sdio_slc_slc0_sub_start_des_reg_t slc_slc0_sub_start_des;
    volatile sdio_slc_slc0_dscr_cnt_reg_t slc_slc0_dscr_cnt;
    volatile sdio_slc_slc0_len_lim_conf_reg_t slc_slc0_len_lim_conf;
    volatile sdio_slc_slc0int_st1_reg_t slc_slc0int_st1;
    volatile sdio_slc_slc0int_ena1_reg_t slc_slc0int_ena1;
    volatile sdio_slc_slc1int_st1_reg_t slc_slc1int_st1;
    volatile sdio_slc_slc1int_ena1_reg_t slc_slc1int_ena1;
    volatile sdio_slc_slc0_tx_sharemem_start_reg_t slc_slc0_tx_sharemem_start;
    volatile sdio_slc_slc0_tx_sharemem_end_reg_t slc_slc0_tx_sharemem_end;
    volatile sdio_slc_slc0_rx_sharemem_start_reg_t slc_slc0_rx_sharemem_start;
    volatile sdio_slc_slc0_rx_sharemem_end_reg_t slc_slc0_rx_sharemem_end;
    volatile sdio_slc_slc1_tx_sharemem_start_reg_t slc_slc1_tx_sharemem_start;
    volatile sdio_slc_slc1_tx_sharemem_end_reg_t slc_slc1_tx_sharemem_end;
    volatile sdio_slc_slc1_rx_sharemem_start_reg_t slc_slc1_rx_sharemem_start;
    volatile sdio_slc_slc1_rx_sharemem_end_reg_t slc_slc1_rx_sharemem_end;
    volatile sdio_slc_hda_tx_sharemem_start_reg_t slc_hda_tx_sharemem_start;
    volatile sdio_slc_hda_rx_sharemem_start_reg_t slc_hda_rx_sharemem_start;
    volatile sdio_slc_burst_len_reg_t slc_burst_len;
    uint32_t reserved_180[30];
    volatile sdio_slc_date_reg_t slc_date;
    volatile sdio_slc_id_reg_t slc_id;
} slc_dev_t;

extern slc_dev_t SLC;

#ifndef __cplusplus
_Static_assert(sizeof(slc_dev_t) == 0x200, "Invalid size of slc_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
